{
  "intents":
    [
        {
            "tag": "greeting",
            "patterns": [
              "Hi",
              "Hey",
              "Hello",
              "Good day"
            ],
            "responses": [
              "Hey :)",
              "Hi there, what can I do for you?",
              "Hi there, how can I help?"
            ]
          },
          {
            "tag": "questions",
            "patterns": [
              "How are you",
              "What's up",
              "whats up"
            ],
            "responses": [
              "I'm great! How can I help?",
              "Doing good! How can I help you?"
            ]
          },
          {
            "tag": "qu_est_ce_que_jofre",
            "patterns": [
              "Qu'est-ce que JoFre ?",
              "C'est quoi JoFre ?",
              "Expliquez JoFre."
            ],
            "responses": [
              "JoFre est une solution Open Source offrant une suite de modules pour gérer efficacement différentes entreprises."
            ]
          },
          {
            "tag": "qu_est_ce_qu_un_erp",
            "patterns": [
              "Qu'est-ce qu'un ERP ?",
              "Définition d'un ERP.",
              "Expliquez ERP."
            ],
            "responses": [
              "Un ERP (Enterprise Resource Planning) est un programme de gestion d'entreprises qui centralise les données et informations essentielles."
            ]
          },
          {
            "tag": "quels_sont_les_modules_de_jofre",
            "patterns": [
              "Quels sont les modules de JoFre ?",
              "Liste des modules de JoFre.",
              "Quelles fonctionnalités offre JoFre ?"
            ],
            "responses": [
              "JoFre propose une gamme de modules tels que Ventes, Achats, Gestion des stocks, Paiement, CRM et Marketing."
            ]
          },
          {
            "tag": "comment_jofre_peut_il_aider_gestion_ventes",
            "patterns": [
              "Comment JoFre peut-il aider dans la gestion des ventes ?",
              "Fonctionnalités de JoFre pour les ventes.",
              "Expliquez l'impact de JoFre sur les ventes."
            ],
            "responses": [
              "JoFre permet de suivre les ventes, gérer la facturation, les commandes et la livraison, ainsi que gérer les catalogues et les prix des produits."
            ]
          },
          {
            "tag": "quelles_sont_fonctionnalites_module_crm",
            "patterns": [
              "Quelles sont les fonctionnalités du module CRM ?",
              "Que peut-on faire avec le CRM de JoFre ?",
              "Expliquez le module CRM."
            ],
            "responses": [
              "Le module CRM de JoFre se concentre sur les clients et le marketing, il permet de suivre des pistes, conclure des affaires et élaborer des prévisions de vente."
            ]
          },
          {
            "tag": "comment_jofre_facilite_t_il_gestion_stocks",
            "patterns": [
              "Comment JoFre facilite-t-il la gestion des stocks ?",
              "Avantages de JoFre dans la gestion des stocks.",
              "Expliquez l'impact de JoFre sur la gestion des stocks."
            ],
            "responses": [
              "JoFre offre toutes les fonctionnalités nécessaires pour gérer les stocks de l'entreprise, y compris les approvisionnements et les relations avec les clients et les points de vente."
            ]
          },
          {
            "tag": "comment_jofre_simplifie_t_il_paiement",
            "patterns": [
              "Comment JoFre simplifie-t-il le paiement ?",
              "Avantages de JoFre pour les paiements.",
              "Expliquez l'impact de JoFre sur les paiements."
            ],
            "responses": [
              "JoFre permet d'effectuer et de recevoir des paiements en toute sécurité dans les comptes PaieCash, 24h/24 et où que vous soyez."
            ]
          },
          {
            "tag": "comment_utiliser_jofre_sur_differents_appareils",
            "patterns": [
              "Comment utiliser JoFre sur différents appareils ?",
              "Compatibilité de JoFre avec les appareils.",
              "JoFre sur ordinateurs et smartphones."
            ],
            "responses": [
              "JoFre est conçu pour être utilisé sur tous les supports, y compris les ordinateurs et les smartphones, grâce à sa simplicité d'utilisation et son intuitivité."
            ]
          },
          {
            "tag": "comptes_clients",
            "patterns": [
              "Comment créer des comptes clients?",
              "Comment fermer des comptes clients?"
            ],
            "responses": [
              "Pour créer des comptes clients, accédez à l'onglet 'Administrateur' et suivez les instructions.",
              "La fermeture des comptes clients peut être effectuée dans l'onglet 'Administrateur'. Suivez les étapes pour clôturer un compte."
            ]
          },
          {
            "tag": "stocks_prix",
            "patterns": [
              "Comment introduire des stocks manuellement?",
              "Comment définir les prix?",
              "Comment gérer les ristournes?"
            ],
            "responses": [
              "L'introduction manuelle des stocks se fait via l'option 'Introduction des stocks manuels' dans l'onglet 'Administrateur'.",
              "Pour définir les prix, accédez à l'onglet 'Administrateur' et suivez les indications.",
              "La gestion des ristournes est possible en suivant les étapes de l'onglet 'Administrateur'."
            ]
          },
          {
            "tag": "factures",
            "patterns": [
              "Comment produire des factures instantanées?",
              "Comment produire des factures QRcode?"
            ],
            "responses": [
              "Les factures instantanées peuvent être générées en utilisant l'option dédiée dans l'onglet 'Administrateur'.",
              "Pour produire des factures avec QRcode, suivez les instructions spécifiques dans l'onglet 'Administrateur'."
            ]
          },
          {
            "tag": "commerciaux",
            "patterns": [
              "Comment affecter des clients aux commerciaux?",
              "Comment répartir les clients par zone?"
            ],
            "responses": [
              "L'affectation des clients aux commerciaux peut être réalisée en accédant à l'onglet 'Commerciaux'. Suivez les étapes pour attribuer les clients.",
              "La répartition des clients par zone est disponible dans l'onglet 'Commerciaux'. Suivez les indications pour une répartition efficace."
            ]
          },
          {
            "tag": "extraction",
            "patterns": [
              "Comment extraire des données globales?",
              "Comment trier par ordre alphabétique?"
            ],
            "responses": [
              "Pour les extractions globales, dirigez-vous vers l'onglet 'Extractions' et suivez les options pertinentes.",
              "Le tri par ordre alphabétique peut être effectué en utilisant l'option de tri dans l'onglet 'Extractions'."
            ]
          },
          {
            "tag": "sous_comptes",
            "patterns": [
              "Comment créer des sous comptes clients?",
              "Comment fermer des sous comptes clients?"
            ],
            "responses": [
              "La création de sous comptes clients se fait via l'onglet dédié dans 'Administrateur'. Suivez les étapes pour créer des sous comptes.",
              "La fermeture des sous comptes clients peut être réalisée dans l'onglet 'Administrateur'. Suivez les instructions."
            ]
          },
          {
            "tag": "inventaire",
            "patterns": [
              "Comment effectuer l'inventaire des stocks?"
            ],
            "responses": [
              "Pour effectuer l'inventaire des stocks, consultez les instructions fournies dans l'onglet dédié 'Inventaire'."
            ]
          },
          {
            "tag": "ventes",
            "patterns": [
              "Comment obtenir l'état des ventes?",
              "Comment obtenir un état des ventes par CA?"
            ],
            "responses": [
              "L'état des ventes peut être obtenu en accédant à l'onglet 'Ventes' et en suivant les indications.",
              "Pour un état des ventes basé sur le chiffre d'affaires, utilisez l'option spécifique dans l'onglet 'Ventes'."
            ]
          },
          {
            "tag": "mdp",
            "patterns": [
              "Comment modifier le mot de passe?"
            ],
            "responses": [
              "Pour modifier le mot de passe, accédez à votre profil et suivez les instructions pour effectuer la modification."
            ]
          },
          {
            "tag": "demande_materiel",
            "patterns": [
              "Comment faire une demande de matériel ?",
              "Processus de demande de matériel",
              "Comment soumettre une demande de matériel ?"
            ],
            "responses": [
              "Pour faire une demande de matériel, utilisez notre plateforme en ligne. Connectez-vous, remplissez le formulaire de demande en fournissant tous les détails nécessaires, puis soumettez-le. Votre demande sera automatiquement envoyée à votre supérieur pour validation."
            ]
          },
          {
            "tag": "validation_niveau",
            "patterns": [
              "Comment fonctionne la validation en niveaux ?",
              "Processus de validation des demandes",
              "Qui valide ma demande de matériel ?"
            ],
            "responses": [
              "Chaque personne dans la hiérarchie a un niveau de validation en quantité de matériel et en finance. Votre demande sera automatiquement acheminée aux personnes concernées selon leur niveau de responsabilité pour approbation."
            ]
          },
          {
            "tag": "accords_envoyes",
            "patterns": [
              "Comment saurai-je si ma demande est approuvée ?",
              "Notification d'approbation",
              "Réception des accords"
            ],
            "responses": [
              "Une fois que votre demande est approuvée, vous recevrez des accords par e-mail. Ces accords couvriront divers aspects tels que les matériaux, les finances et les achats de logiciels."
            ]
          },
          {
            "tag": "signature_electronique",
            "patterns": [
              "Comment fonctionne la signature électronique ?",
              "Processus de signature des accords",
              "Comment signer électroniquement ?"
            ],
            "responses": [
              "La signature électronique est simple. Suivez les instructions fournies dans l'e-mail d'approbation pour signer électroniquement les accords. Cela permet de formaliser votre accord et de finaliser le processus."
            ]
          },
          {
            "tag": "design_application_mobile_paiecash_qr",
            "patterns": [
              "Qu'est-ce que le design de l'application mobile Paiecash QR ?",
              "Où puis-je trouver des informations sur le design de l'application mobile Paiecash QR ?"
            ],
            "responses": [
              "Le design de l'application mobile Paiecash QR concerne la conception visuelle de l'interface utilisateur de l'application. Vous pouvez en savoir plus en consultant le lien suivant : [Lien vers Figma](https://www.figma.com/file/DCuVa2DXlebwOTYC3VIMNW/carte-paiecash?type=design&node-id=294%3A1976&mode=design&t=mieg0kLWF0BZa16R-1)."
            ]
          },
          {
            "tag": "login",
            "patterns": [
              "Comment me connecter ?",
              "Identifiants de connexion",
              "Je n'arrive pas à me connecter."
            ],
            "responses": [
              "Pour vous connecter, accédez à https://qr.frontend.paiecash.fr/sign-in et utilisez les identifiants suivants : email - admin@paiecash.com, mot de passe - password."
            ]
          },
          {
            "tag": "repos",
            "patterns": [
              "Où puis-je trouver les repos ?",
              "Emplacements des repos ?",
              "Liens des repos ?"
            ],
            "responses": [
              "Vous pouvez trouver les repos de Paiecash aux liens suivants : [Repo principal Paiecash](https://gitlab.com/paiecash2023) et [Repo Paiecash QR](https://gitlab.com/paiecash-qr)."
            ]
          },
          {
            "tag": "password",
            "patterns": [
              "Où est le mot de passe ?",
              "Où trouver le mot de passe ?",
              "Comment obtenir le mot de passe ?"
            ],
            "responses": [
              "Le mot de passe est disponible ici : [Lien vers le document du mot de passe](https://docs.google.com/document/d/15UzCxvl-luB0JlJlt8XZLYsdqI75AK36tAG9wDzu6bU/edit)"
            ]
          },
          {
            "tag": "trello",
            "patterns": [
              "Comment puis-je accéder au Trello de Paiecash ?",
              "Lien vers le Trello de Paiecash ?",
              "Où trouver le Trello ?"
            ],
            "responses": [
              "Vous pouvez accéder au tableau Trello de Paiecash en suivant ce lien : [Trello Paiecash](https://trello.com/b/MSse4jHo/qr-paiecash)"
            ]
          },
          {
            "tag": "general",
            "patterns": [
              "Qu'est-ce que le module de Géolocalisation de Paiecash ?",
              "À quoi sert le module de Géolocalisation ?"
            ],
            "responses": [
              "Le module de Géolocalisation enregistre les positions des utilisateurs, revendeurs, distributeurs et commerciaux de Paiecash pour faciliter la géolocalisation et les interactions."
            ]
          },
          {
            "tag": "utilisation",
            "patterns": [
              "Comment fonctionne la géolocalisation des utilisateurs de Paiecash ?",
              "Comment activer la géolocalisation sur mon téléphone ?"
            ],
            "responses": [
              "La géolocalisation enregistre les coordonnées des utilisateurs ayant autorisé l'accès à leur position. Consultez nos guides pour activer la géolocalisation sur votre téléphone."
            ]
          },
          {
            "tag": "fonctionnalites",
            "patterns": [
              "Quelles sont les fonctionnalités du module de Géolocalisation ?",
              "Que peut-on faire avec la géolocalisation des revendeurs ?"
            ],
            "responses": [
              "Le module permet de géolocaliser les revendeurs, distributeurs et commerciaux. Il offre la liste des revendeurs proches d'un utilisateur, facilitant ainsi la recherche de points de vente Paiecash."
            ]
          },
          {
            "tag": "avantages",
            "patterns": [
              "Quels sont les avantages de la géolocalisation dans Paiecash ?",
              "Comment la géolocalisation améliore-t-elle l'expérience utilisateur ?"
            ],
            "responses": [
              "La géolocalisation réduit les temps de réponse, améliore l'expérience client et permet la recherche facile de points de vente proches."
            ]
          },
          {
            "tag": "mise_a_jour",
            "patterns": [
              "Comment puis-je mettre à jour mes informations de géolocalisation ?",
              "Les informations de géolocalisation sont-elles mises à jour automatiquement ?"
            ],
            "responses": [
              "Les informations de géolocalisation sont mises à jour automatiquement lorsque les utilisateurs autorisent l'accès à leur position actuelle."
            ]
          },
          {
            "tag": "depots",
            "patterns": [
              "Comment effectuer un dépôt ?",
              "Quelles sont les méthodes de dépôt ?"
            ],
            "responses": [
              "Les utilisateurs enregistrés peuvent effectuer un dépôt dans Paiecash. Vous pouvez sélectionner parmi nos méthodes de paiement pour effectuer un dépôt. Le montant déposé peut être choisi et ajouté au portefeuille que vous préférez."
            ]
          },
          {
            "tag": "carte_bancaire",
            "patterns": [
              "Comment obtenir une carte bancaire ?",
              "Quels sont les types de cartes disponibles ?"
            ],
            "responses": [
              "Lors de l'inscription, vous obtenez automatiquement une carte bancaire numérique. Si vous préférez une carte physique, vous devrez attendre généralement trois semaines. La carte physique est livrée chez un distributeur proche de chez vous en Afrique ou par courrier pour le reste du monde."
            ]
          },
          {
            "tag": "transferts",
            "patterns": [
              "Comment effectuer un transfert d'argent ?",
              "Quelles sont les options de transfert ?"
            ],
            "responses": [
              "Vous pouvez transférer de l'argent à tout utilisateur enregistré ou non enregistré. Les utilisateurs non enregistrés verront leur argent une fois inscrits. L'administrateur peut bloquer ou rembourser en cas de problème illégal."
            ]
          },
          {
            "tag": "parrainage",
            "patterns": [
              "Comment fonctionne le parrainage ?",
              "Quels sont les avantages du parrainage ?"
            ],
            "responses": [
              "Le parrainage vous permet de gagner des commissions sur les transactions de vos filleuls. Chaque utilisateur a un code de parrainage unique. Plus vous parrainez d'utilisateurs, plus vous gagnez de commissions sur leurs transactions."
            ]
          },
          {
            "tag": "commissions",
            "patterns": [
              "Comment sont calculées les commissions ?",
              "Quels sont les taux de commissions ?"
            ],
            "responses": [
              "Les commissions sont calculées sur la base des revenus du système Paiecash. Les taux de commissions peuvent être modifiés par l'administrateur. Par exemple, 30% des revenus sont attribués aux distributeurs et 20% aux revendeurs."
            ]
          },
          {
            "tag": "faq",
            "patterns": [
              "Qu'est-ce que Paiecash ?",
              "Quelles sont les fonctionnalités de Paiecash ?",
              "Comment puis-je m'inscrire sur Paiecash ?",
              "Comment fonctionnent les cartes de fidélité sur Paiecash ?",
              "Comment puis-je utiliser les codes QR de Paiecash ?",
              "Comment fonctionnent les notifications sur Paiecash ?",
              "Comment fonctionnent les paiements en ligne sur Paiecash ?",
              "Comment puis-je obtenir de l'assistance sur Paiecash ?"
            ],
            "responses": [
              "Paiecash est une plateforme de paiement en ligne et de gestion de cartes de fidélité. Elle propose diverses fonctionnalités pour les utilisateurs et les commerçants.",
              "Paiecash offre diverses fonctionnalités telles que les paiements en ligne, la gestion des cartes de fidélité, la création de codes QR pour les paiements et les promotions, ainsi que la possibilité d'envoyer des notifications aux membres.",
              "Vous pouvez vous inscrire sur Paiecash en créant un compte via l'application mobile ou le site web. Suivez les instructions fournies pour compléter le processus d'inscription.",
              "Les cartes de fidélité de Paiecash permettent aux utilisateurs de cumuler des points d'achat et de bénéficier de réductions, de promotions et de cadeaux chez les commerçants participants.",
              "Les codes QR de Paiecash peuvent être utilisés pour effectuer des paiements rapides chez les commerçants participants. Scannez simplement le code QR du commerçant avec l'application Paiecash pour effectuer le paiement.",
              "Paiecash permet d'envoyer des notifications aux membres, y compris des offres spéciales, des mises à jour et des informations importantes. Les membres peuvent gérer leurs préférences de notification dans l'application.",
              "Paiecash facilite les paiements en ligne en utilisant des portefeuilles virtuels. Les utilisateurs peuvent charger de l'argent sur leur portefeuille et l'utiliser pour effectuer des paiements en ligne chez les commerçants participants.",
              "Vous pouvez obtenir de l'assistance sur Paiecash en utilisant la fonction de chat en direct dans l'application ou en visitant la section d'aide sur le site web. Notre équipe d'assistance est là pour vous aider avec toutes vos questions et préoccupations."
            ]
          },
          {
            "tag": "avantages_club_foot_paiecash",
            "patterns": [
              "Quels sont les avantages d'utiliser Paiecash dans un club de foot ?",
              "Quels bénéfices offre Paiecash aux clubs de football ?"
            ],
            "responses": [
              "Paiecash offre des avantages aux clubs de football, tels que la possibilité de proposer des promotions aux membres, de gérer les affiliations et les paiements des supporters, ainsi que de faciliter les achats de billets et de produits."
            ]
          },
          {
            "tag": "paiement_qr_code_paiecash",
            "patterns": [
              "Comment fonctionne le paiement par QR code sur Paiecash ?",
              "Expliquez le processus de paiement via QR code sur Paiecash."
            ],
            "responses": [
              "Le paiement par QR code sur Paiecash permet aux utilisateurs de scanner le code avec l'application pour effectuer des paiements instantanés. Les détails de la transaction sont générés dans le code."
            ]
          },
          {
            "tag": "support_client_paiecash",
            "patterns": [
              "Comment puis-je contacter le support client de Paiecash ?",
              "Quels sont les moyens de contacter le support client de Paiecash ?"
            ],
            "responses": [
              "Vous pouvez contacter le support client de Paiecash via l'application en utilisant la fonction de messagerie ou en envoyant un e-mail à l'adresse de support fournie sur le site web."
            ]
          },
          {
            "tag": "promotions_nouvelles_fonctionnalites_paiecash",
            "patterns": [
              "Comment être informé des promotions et des nouvelles fonctionnalités sur Paiecash ?",
              "Où puis-je trouver des informations sur les promotions et les mises à jour de Paiecash ?"
            ],
            "responses": [
              "Vous serez informé des promotions et des nouvelles fonctionnalités de Paiecash via des notifications dans l'application, des e-mails et des annonces sur le site web."
            ]
          },
          {
            "tag": "mise_a_jour_informations_compte_paiecash",
            "patterns": [
              "Comment mettre à jour mes informations de compte sur Paiecash ?",
              "Quelle est la procédure pour modifier les détails de mon compte Paiecash ?"
            ],
            "responses": [
              "Vous pouvez mettre à jour vos informations de compte sur Paiecash en accédant à vos paramètres de profil dans l'application ou sur le site web et en modifiant les détails nécessaires."
            ]
          },
          {
            "tag": "gestion_partenariats_commercants_paiecash",
            "patterns": [
              "Comment fonctionne la gestion des partenariats avec les commerçants sur Paiecash ?",
              "Expliquez le processus de partenariat entre Paiecash et les commerçants."
            ],
            "responses": [
              "Paiecash permet aux commerçants de créer des offres et des promotions pour les utilisateurs. Les utilisateurs peuvent profiter de réductions et de récompenses en effectuant des achats chez les partenaires de Paiecash."
            ]
          },
          {
            "tag": "suivi_transactions_paiements_paiecash",
            "patterns": [
              "Comment puis-je suivre mes transactions et paiements sur Paiecash ?",
              "Où puis-je consulter l'historique de mes paiements et de mes transactions sur Paiecash ?"
            ],
            "responses": [
              "Vous pouvez suivre vos transactions et paiements sur Paiecash en consultant l'historique des transactions dans l'application. Vous y trouverez des détails sur vos achats et vos paiements."
            ]
          },
          {
            "tag": "mesures_securite_paiecash",
            "patterns": [
              "Quelles sont les mesures de sécurité mises en place par Paiecash ?",
              "Comment Paiecash garantit-il la sécurité de mes données et de mes paiements ?"
            ],
            "responses": [
              "Paiecash utilise des mesures de sécurité avancées pour protéger vos données personnelles et vos informations de paiement. Le paiement par QR code et la connexion sécurisée font partie des méthodes de sécurité."
            ]
          },
          {
            "tag": "systeme_cashback_paiecash",
            "patterns": [
              "Comment fonctionne le système de cashback pour les utilisateurs de Paiecash ?",
              "Expliquez le système de cashback proposé par Paiecash."
            ],
            "responses": [
              "Le système de cashback de Paiecash permet aux utilisateurs de gagner de l'argent en effectuant des achats chez les commerçants partenaires. Une partie du montant dépensé est reversée sous forme de cashback."
            ]
          },
          {
            "tag": "qu_est_ce_que_paiecash",
            "patterns": [
              "Qu'est-ce que PaieCash ?",
              "Pouvez-vous me donner une description de PaieCash ?"
            ],
            "responses": [
              "PaieCash est une entreprise innovante opérant en Afrique, offrant des solutions numériques dans les domaines de la téléphonie, d'Internet et de la télévision. Notre objectif est de simplifier les transactions et les paiements en ligne pour tout le monde."
            ]
          },
          {
            "tag": "objectif_du_projet",
            "patterns": [
              "Quel est l'objectif du projet PaieCash ?",
              "Quels sont les buts visés par le projet PaieCash ?"
            ],
            "responses": [
              "Le projet vise à créer une application mobile sur Android et IOS, ainsi qu'un site web, permettant aux utilisateurs de réaliser des transactions financières, d'envoyer et de recevoir de l'argent, d'effectuer des paiements en ligne, et bien plus encore."
            ]
          },
          {
            "tag": "fonctionnalites_principales",
            "patterns": [
              "Quelles sont les fonctionnalités principales de l'application PaieCash ?",
              "Pouvez-vous me donner un aperçu des principales fonctionnalités de PaieCash ?"
            ],
            "responses": [
              "L'application PaieCash propose une gamme complète de services : transferts d'argent entre utilisateurs, dépôts et retraits, paiements en ligne sur des sites marchands, gestion de comptes utilisateurs, échanges de devises, épargne, crédits, et bien d'autres."
            ]
          },
          {
            "tag": "difference_avec_la_concurrence",
            "patterns": [
              "Comment PaieCash se démarque-t-il de la concurrence ?",
              "Qu'est-ce qui distingue PaieCash de ses concurrents ?"
            ],
            "responses": [
              "Nous rassemblons une variété de moyens de paiement numérique en une seule application conviviale. De plus, notre portée internationale vous permet d'effectuer des transactions en Afrique et à l'international en toute fiabilité."
            ]
          },
          {
            "tag": "conception_des_interfaces",
            "patterns": [
              "Comment sont conçus les interfaces de PaieCash ?",
              "Pouvez-vous expliquer la conception des interfaces de PaieCash ?"
            ],
            "responses": [
              "Nos interfaces suivent les normes ergonomiques de l'UI/UX design, garantissant une expérience utilisateur intuitive et conviviale. Nous respectons les normes ISO 26800:2011 pour une expérience optimale."
            ]
          },
          {
            "tag": "avantages_du_projet",
            "patterns": [
              "Quels sont les avantages du projet PaieCash ?",
              "Pouvez-vous me donner des détails sur les bénéfices du projet PaieCash ?"
            ],
            "responses": [
              "PaieCash résout le problème du manque de liquidités en Afrique. Il facilite les paiements entre acteurs économiques et offre une solution de paiement rapide et fiable pour tous."
            ]
          },
          {
            "tag": "devenir_un_utilisateur",
            "patterns": [
              "Comment puis-je devenir un utilisateur de PaieCash ?",
              "Quelle est la procédure pour devenir utilisateur de PaieCash ?"
            ],
            "responses": [
              "Toute personne possédant un téléphone portable peut devenir un utilisateur. Si vous souhaitez effectuer des transactions en ligne, notre application est là pour vous."
            ]
          },
          {
            "tag": "budget_developpement",
            "patterns": [
              "Quel est le budget pour le développement de l'application ?",
              "Pouvez-vous me donner une idée du coût de développement de l'application ?"
            ],
            "responses": [
              "Le budget varie en fonction du développement, de la sécurité et du déploiement. Contactez-nous pour une estimation personnalisée."
            ]
          },
          {
            "tag": "disponibilite_application",
            "patterns": [
              "Quand l'application sera-t-elle disponible ?",
              "Avez-vous une date de lancement prévue pour l'application ?"
            ],
            "responses": [
              "La date de livraison dépend de la taille du projet, mais soyez assuré que nous travaillons dur pour vous offrir la meilleure expérience dans les plus brefs délais."
            ]
          },
          {
            "tag": "obtenir_de_l_aide",
            "patterns": [
              "Comment puis-je obtenir de l'aide en cas de problème ?",
              "Quelle est la marche à suivre si j'ai des problèmes avec l'application ?"
            ],
            "responses": [
              "Vous pouvez contacter notre équipe d'assistance via l'application ou notre site web. Nous sommes là pour vous aider à chaque étape."
            ]
          },
          {
            "tag": "plus_informations_fonctionnalites",
            "patterns": [
              "Où puis-je trouver plus d'informations sur les fonctionnalités de PaieCash ?",
              "Existe-t-il un document détaillé sur les fonctionnalités de PaieCash ?"
            ],
            "responses": [
              "Consultez notre document de spécifications fonctionnelles pour obtenir une vue d'ensemble détaillée des fonctionnalités : Lien vers le document."
            ]
          },
          {
            "tag": "maquettes_application",
            "patterns": [
              "Où puis-je voir les maquettes de l'application ?",
              "Avez-vous des exemples visuels de l'application que je peux consulter ?"
            ],
            "responses": [
              "Les maquettes actuelles sont disponibles ici : Lien vers les maquettes."
            ]
          },
          {
            "tag": "depots",
            "patterns": [
              "Comment effectuer un dépôt dans Paiecash?",
              "Quelles sont les méthodes de paiement pour les dépôts?",
              "Comment choisir un portefeuille pour le dépôt?"
            ],
            "responses": [
              "Les utilisateurs enregistrés peuvent effectuer un dépôt dans Paiecash en utilisant nos méthodes de paiement système. Vous pouvez choisir le portefeuille dans lequel vous souhaitez déposer le montant."
            ]
          },
          {
            "tag": "cartes",
            "patterns": [
              "Comment obtenir une carte bancaire Paiecash?",
              "Quelle est la procédure pour obtenir une carte physique?",
              "Comment fonctionne la carte numérique?"
            ],
            "responses": [
              "Lors de l'inscription, les utilisateurs reçoivent automatiquement une carte numérique. Si vous souhaitez une carte physique, elle peut être commandée et livrée en quelques semaines. La carte physique peut être retirée chez un distributeur proche en Afrique et livrée par courrier ailleurs dans le monde."
            ]
          },
          {
            "tag": "transferts",
            "patterns": [
              "Puis-je transférer de l'argent à tout utilisateur?",
              "Qu'en est-il des transferts vers des utilisateurs non enregistrés?",
              "Comment fonctionne le transfert de montant?"
            ],
            "responses": [
              "Les utilisateurs enregistrés peuvent transférer de l'argent à tout utilisateur, enregistré ou non. Les utilisateurs non enregistrés peuvent voir leur argent une fois inscrits. Vous pouvez également contacter le Call center en cas de problème ou de besoin d'informations."
            ]
          },
          {
            "tag": "depots",
            "patterns": [
              "Comment effectuer un dépôt?",
              "Quelles sont les méthodes de dépôt?",
              "Comment sélectionner un portefeuille pour le dépôt?"
            ],
            "responses": [
              "Les utilisateurs enregistrés peuvent effectuer un dépôt dans Paiecash en utilisant nos méthodes de paiement disponibles. Choisissez la méthode de dépôt préférée et sélectionnez le portefeuille dans lequel vous souhaitez déposer le montant."
            ]
          },
          {
            "tag": "carte_bancaire",
            "patterns": [
              "Comment obtenir une carte bancaire Paiecash?",
              "Quels types de cartes Paiecash sont disponibles?",
              "Comment fonctionne la carte bancaire Paiecash?"
            ],
            "responses": [
              "Lorsque vous vous inscrivez sur Paiecash, vous obtenez automatiquement une carte bancaire numérique. Pour une carte physique, vous pouvez en commander une qui sera livrée en quelques semaines. La carte physique peut être utilisée pour des transactions chez les distributeurs en Afrique et par un service de courrier pour le reste du monde."
            ]
          },
          {
            "tag": "montant_du_transfert",
            "patterns": [
              "Comment transférer de l'argent à un utilisateur?",
              "Quels sont les frais pour transférer de l'argent?",
              "Comment contacter le service client en cas de problème de transfert?"
            ],
            "responses": [
              "Les utilisateurs enregistrés peuvent transférer de l'argent à tout utilisateur enregistré ou non enregistré. Les frais de transfert peuvent varier en fonction des montants et des méthodes de paiement. En cas de problème de transfert, veuillez contacter notre service client."
            ]
          },
          {
            "tag": "paiement_dans_les_entreprises",
            "patterns": [
              "Puis-je effectuer un paiement dans les hôpitaux ou d'autres entreprises?",
              "Comment fonctionne le paiement des factures dans la diaspora?",
              "Est-ce que Paiecash propose des paiements dans les supermarchés?"
            ],
            "responses": [
              "Oui, vous pouvez effectuer des paiements dans des entreprises, y compris les hôpitaux. Vous pouvez également payer des factures via Paiecash lorsque vous êtes à l'étranger. Nous proposons également une carte Kdo pour payer dans les supermarchés, pharmacies et autres commerces."
            ]
          },
          {
            "tag": "echange_de_devises",
            "patterns": [
              "Comment fonctionne l'échange de devises sur Paiecash?",
              "Quelles sont les méthodes d'échange disponibles?",
              "Comment le taux de change est-il déterminé?"
            ],
            "responses": [
              "Sur Paiecash, vous pouvez échanger différentes devises en payant de l'argent. Le taux de change peut être défini comme local ou via API. Le montant sera converti en fonction du taux de change et ajouté à votre portefeuille. L'administrateur peut voir les détails de chaque échange dans Currency Exchange."
            ]
          },
          {
            "tag": "methodes_de_paiement",
            "patterns": [
              "Quelles sont les méthodes de paiement acceptées?",
              "Pouvez-vous me dire quelles méthodes de paiement sont disponibles?",
              "Comment activer ou désactiver les méthodes de paiement?"
            ],
            "responses": [
              "Actuellement, nous acceptons 8 méthodes de paiement pour les dépôts, y compris Banque Atlantique, MasterCard, Orange Money et MTN Money. Vous pouvez activer ou désactiver ces méthodes depuis les paramètres."
            ]
          },
          {
            "tag": "roles_et_autorisations",
            "patterns": [
              "Quels sont les différents rôles sur Paiecash?",
              "Comment ajouter un administrateur?",
              "Quels sont les privilèges d'un agent Paiecash?"
            ],
            "responses": [
              "Il existe différents rôles sur Paiecash, dont le super administrateur, les administrateurs, les agents Paiecash, etc. En tant que propriétaire, vous pouvez ajouter d'autres utilisateurs en tant qu'administrateurs avec des autorisations spécifiques."
            ]
          },
          {
            "tag": "gerer_les_comptes",
            "patterns": [
              "Comment gérer son compte sur PaieCash ?",
              "Quelles sont les fonctionnalités liées à la gestion des comptes ?"
            ],
            "responses": [
              "Vous pouvez gérer votre compte en affichant votre solde et en effectuant des échanges de devises (en fonction des pays et taux de conversion, disponibles dans les versions ultérieures), ainsi qu'en rechargeant votre compte.",
              "Les outils de gestion des dépenses et de budget sont également disponibles pour vous aider à suivre vos dépenses et vos multiples comptes en fonction des différentes devises disponibles."
            ]
          },
          {
            "tag": "effectuer_transaction",
            "patterns": [
              "Comment effectuer des transactions sur PaieCash ?",
              "Quelles sont les types de transactions possibles ?"
            ],
            "responses": [
              "Vous pouvez effectuer diverses transactions sur PaieCash, notamment des recharges, des retraits, des dépôts et d'autres transactions financières.",
              "Les fonctionnalités de recharges, retraits et dépôts vous offrent la flexibilité nécessaire pour gérer vos fonds à votre convenance."
            ]
          },
          {
            "tag": "qr_pour_verifier_les_reservations",
            "patterns": [
              "Comment fonctionne l'émission et la numérisation des billets QR ?",
              "Quels sont les avantages de l'utilisation des billets QR pour les réservations ?"
            ],
            "responses": [
              "L'émission de billets QR et leur numérisation avec un terminal mobile permettent de vérifier l'état de réservation des passagers et d'afficher un plan de sièges à l'écran pour montrer où s'asseoir.",
              "Les principaux avantages incluent une vérification rapide du statut de réservation, une réduction du temps d'embarquement par passager, une réduction des charges sur l'équipage et la facilitation du placement des passagers."
            ]
          },
          {
            "tag": "service_de_coupons_mobiles",
            "patterns": [
              "Comment fonctionne le service de coupons mobiles ?",
              "Quels sont les avantages de l'introduction des coupons mobiles ?"
            ],
            "responses": [
              "En envoyant des coupons mobiles sur les smartphones des clients et en les lisant avec un scanner de point de vente, un service de coupons peut être introduit avec moins de fardeau et la satisfaction du client sera améliorée.",
              "Les principaux avantages incluent une introduction à moindre coût, l'élimination des besoins de coupons papier, et l'amélioration de la satisfaction des clients."
            ]
          },
          {
            "tag": "code_frameqr_pour_la_surveillance",
            "patterns": [
              "Comment fonctionne le code FrameQR® sur les produits ?",
              "Quels sont les avantages de la surveillance avec le code FrameQR® ?"
            ],
            "responses": [
              "Le code FrameQR® peut être ajouté sur les produits pour collecter l'historique des informations sur son utilisation. Cela permet de surveiller les contrefaçons et les exportations illégales.",
              "Les principaux avantages incluent la détection des actions suspectes, la surveillance des contrefaçons et des exportations illégales, et l'amélioration de l'image de marque."
            ]
          },
          {
            "tag": "protection_des_donnees_avec_sqrc",
            "patterns": [
              "Comment fonctionne la protection des données avec SQRC ?",
              "Quelle est la différence entre SQRC et le QR Code conventionnel ?"
            ],
            "responses": [
              "Un seul QR Code peut transporter des données publiques et privées. Les données privées ne peuvent être lues qu'avec un lecteur disposant de la clé cryptographique, assurant ainsi la protection des données.",
              "La différence entre SQRC et le QR Code conventionnel réside dans la sécurité. Le QR Code conventionnel expose toutes les informations, tandis que SQRC permet de rendre l'information privée, en limitant les types d'appareils qui peuvent la lire."
            ]
          },
          {
            "tag": "qui_sommes_nous",
            "patterns": [
              "Qui sommes-nous ?",
              "Pouvez-vous me parler de votre entreprise ?"
            ],
            "responses": [
              "Vous pouvez consulter nos Mentions Légales disponibles sur notre site internet paiecashqr.com."
            ]
          },
          {
            "tag": "utilisation_des_donnees_personnelles_collectees",
            "patterns": [
              "Quand collectez-vous des données personnelles ?",
              "Quelles données personnelles collectez-vous et quand ?"
            ],
            "responses": [
              "Dans le cadre de la navigation sur le site web, dans l’envoi de formulaires ou le passage de commandes, des données personnelles sont collectées."
            ]
          },
          {
            "tag": "statistiques_du_site_et_mesure_daudeience",
            "patterns": [
              "Comment utilisez-vous les cookies ?",
              "À quelles fins utilisez-vous les cookies sur votre site ?"
            ],
            "responses": [
              "Pour améliorer le parcours sur notre site internet et mieux comprendre nos utilisateurs, nous utilisons des services tiers qui se servent de cookies pour vous identifier."
            ]
          },
          {
            "tag": "gerer_votre_consentement",
            "patterns": [
              "Que se passe-t-il lorsque je remplis un formulaire de contact ?",
              "Comment mes informations sont-elles traitées lorsque je contacte votre équipe ?"
            ],
            "responses": [
              "Lorsque vous remplissez un formulaire de contact, vos données saisies sont enregistrées automatiquement dans notre base de données et votre demande est transmise par e-mail à notre équipe."
            ]
          },
          {
            "tag": "stockage_des_informations_de_paiement",
            "patterns": [
              "Stockez-vous les informations de paiement ?",
              "Comment gérez-vous les informations de paiement des utilisateurs ?"
            ],
            "responses": [
              "Si notre site internet a déployé une option e-commerce, sachez que nous stockons toutes les informations de livraison, de facturation et tous les détails des commandes. Nous ne stockons cependant pas vos numéros de carte bancaire. L’étape du paiement est sécurisée et externalisée via un prestataire de service de paiement."
            ]
          },
          {
            "tag": "durees_de_conservation_des_donnees",
            "patterns": [
              "Pendant combien de temps conservez-vous mes données personnelles ?",
              "Quelles sont les durées de conservation de mes données ?"
            ],
            "responses": [
              "Pour votre information, notre système e-commerce peut être amené à conserver vos données personnelles selon les durées suivantes :",
              "Conservation des comptes inactifs : 1 an",
              "Conservation des commandes en attente : 1 an",
              "Conservation des commandes échouées : 1 an",
              "Conservation des commandes annulées : 1 an",
              "Conservation des commandées terminées : 1 an, en cas de produits téléchargeables, vous êtes tenus de les stocker dans un endroit sécurisé avant suppression automatique."
            ]
          },
          {
            "tag": "extraction_et_suppression_des_donnees",
            "patterns": [
              "Comment puis-je demander l'extraction de mes données personnelles ?",
              "Comment puis-je demander la suppression de mes données personnelles ?"
            ],
            "responses": [
              "Sélectionnez un type de demande et soumettez votre demande via notre adresse de contact :",
              "1. Exporter mes données personnelles",
              "2. Supprimer mes données personnelles",
              "Votre adresse de messagerie (obligatoire)"
            ]
          },
          {
            "tag": "qu_est_ce_que_paiecash_qr_code",
            "patterns": [
              "Qu'est-ce que PaieCash QR Code ?",
              "Expliquez PaieCash QR Code."
            ],
            "responses": [
              "PaieCash QR Code est une solution de tickets de caisse dématérialisés via un QR code. Placé directement à la caisse de votre magasin, elle vous permet de récupérer votre facture ou ticket de caisse immédiatement et de façon permanente tout en conservant vos droits de garantie."
            ]
          },
          {
            "tag": "comment_s_inscrire_sur_l_application_mobile",
            "patterns": [
              "Comment s'inscrire sur l'application mobile ?",
              "Quelle est la procédure d'inscription sur l'appli mobile ?"
            ],
            "responses": [
              "Vous pouvez vous inscrire sur l'application mobile de PaieCash QR Code de deux manières : en utilisant votre compte Google ou Facebook, ou en vous inscrivant par e-mail avec l'envoi d'un code de vérification."
            ]
          },
          {
            "tag": "comment_gerer_le_panier_utilisateur",
            "patterns": [
              "Comment gérer le panier utilisateur ?",
              "Expliquez comment fonctionne la gestion du panier utilisateur."
            ],
            "responses": [
              "Vous pouvez gérer votre panier utilisateur à travers l'application mobile. Ajoutez des produits, modifiez les quantités et supprimez des éléments selon vos besoins."
            ]
          },
          {
            "tag": "quels_sont_les_moyens_de_paiement_acceptes",
            "patterns": [
              "Quels sont les moyens de paiement acceptés ?",
              "Dites-moi les options de paiement disponibles."
            ],
            "responses": [
              "Vous pouvez régler votre facture via différents moyens de paiement, y compris PaieCash, Google Pay, Apple Pay, carte bancaire, et d'autres options."
            ]
          },
          {
            "tag": "exemples_d_applications_concurrentes",
            "patterns": [
              "Pouvez-vous donner des exemples d'applications concurrentes ?",
              "Citez des applications similaires à PaieCash QR Code."
            ],
            "responses": [
              "Voici quelques exemples d'applications concurrentes similaires à PaieCash QR Code :",
              "- Limpidius : [Lien vers leur site Web](https://limpidius.com/fr_fr/solutions/dematerialisation)",
              "- Tickie : [Lien vers leur site Web](https://www.tickie.io/en)"
            ]
          },
          {
            "tag": "comment_fonctionne_le_processus_de_vente",
            "patterns": [
              "Comment fonctionne le processus de vente ?",
              "Expliquez le déroulement de la vente."
            ],
            "responses": [
              "Le processus de vente commence lorsque les joueurs ou les clients scannent les QR codes ou les codes-barres des produits avec l'application mobile. Ils construisent ensuite leur panier d'achats. Le caissier scanne le QR code affiché sur le téléphone du client, et le client peut régler sa facture via différents moyens de paiement."
            ]
          },
          {
            "tag": "comment_les_fournisseurs_de_produits_utilisent_ils_l_application",
            "patterns": [
              "Comment les fournisseurs de produits utilisent-ils l'application ?",
              "Quel est l'usage de l'appli pour les fournisseurs de produits ?"
            ],
            "responses": [
              "Les fournisseurs de produits peuvent utiliser l'application pour suivre la quantité de produits restants en stock dans le magasin. Une API facilite les paiements et la gestion des stocks."
            ]
          },
          {
            "tag": "quelles_sont_les_fonctionnalites_du_tableau_de_bord_web",
            "patterns": [
              "Quelles sont les fonctionnalités du tableau de bord web ?",
              "Listez les caractéristiques du tableau de bord en ligne."
            ],
            "responses": [
              "Le tableau de bord web offre de nombreuses fonctionnalités, notamment la gestion de caisse, les bons cadeaux, la gestion complète du processus de vente, la gestion des produits hors taxe, la gestion des produits inconnus, la gestion des programmes de fidélité, la gestion du fond de caisse, l'historique de caisse, l'impression de reçus, l'impression des étiquettes produit, la mise en attente des clients, le plan de salle, le retour et l'échange de produit, le retrait et le dépôt d'espèces, la gestion des stocks, et bien plus encore."
            ]
          },
          {
            "tag": "comment_puis_je_obtenir_de_l_aide_en_cas_de_probleme",
            "patterns": [
              "Comment puis-je obtenir de l'aide en cas de problème ?",
              "Que faire si j'ai besoin d'assistance ?"
            ],
            "responses": [
              "Si vous avez besoin d'aide ou rencontrez un problème, vous pouvez contacter notre équipe d'assistance via l'application ou notre site web. Nous sommes là pour vous aider à chaque étape."
            ]
          },
          {
            "tag": "qu_est_ce_que_paiecash_qr_code",
            "patterns": [
              "Qu'est-ce que PaieCash QR Code ?",
              "C'est quoi PaieCash QR Code ?",
              "Expliquez PaieCash QR Code."
            ],
            "responses": [
              "PaieCash QR Code est une solution de tickets de caisse dématérialisés via un QR code. Placé directement à la caisse de votre magasin, elle vous permet de récupérer votre facture ou ticket de caisse immédiatement et de façon permanente tout en conservant vos droits de garantie."
            ]
          },
          {
            "tag": "comment_fonctionne_paiecash_qr_code",
            "patterns": [
              "Comment fonctionne PaieCash QR Code ?",
              "Expliquez le fonctionnement de PaieCash QR Code."
            ],
            "responses": [
              "Les utilisateurs scannent les QR codes ou les codes-barres des produits et construisent leur panier à travers l'application mobile. Le caissier scanne ensuite le QR code affiché sur le téléphone du client. Le client règle sa facture via différents moyens de paiement."
            ]
          },
          {
            "tag": "quelles_sont_les_fonctionnalites_de_paiecash_qr_code",
            "patterns": [
              "Quelles sont les fonctionnalités de PaieCash QR Code ?",
              "Donnez-moi un aperçu des fonctionnalités de PaieCash QR Code."
            ],
            "responses": [
              "PaieCash QR Code propose les fonctionnalités suivantes : les joueurs et clients paient, le cashback, les points de fidélité. Le fournisseur de produit peut voir la quantité de produit restante du magasin. Il y a également une API pour faciliter les paiements et gérer le stock."
            ]
          },
          {
            "tag": "comment_puis_je_devenir_un_utilisateur_de_paiecash_qr_code",
            "patterns": [
              "Comment puis-je devenir un utilisateur de PaieCash QR Code ?",
              "Quelles sont les étapes pour devenir utilisateur de PaieCash QR Code ?",
              "Je veux utiliser PaieCash QR Code, comment faire ?"
            ],
            "responses": [
              "Pour devenir un utilisateur de PaieCash QR Code, vous pouvez scanner le QR code d'un supermarché qui utilise PaieCash. Cela facilitera votre inscription en scannant simplement le QR code."
            ]
          },
          {
            "tag": "quelles_sont_les_etapes_pour_demarrer_un_achat_avec_paiecash_qr_code",
            "patterns": [
              "Quelles sont les étapes pour démarrer un achat avec PaieCash QR Code ?",
              "Comment commencer un achat avec PaieCash QR Code ?"
            ],
            "responses": [
              "Pour démarrer un achat avec PaieCash QR Code, suivez ces étapes : scannez le QR code ou le code-barres du produit, construisez votre panier via l'application mobile, faites scanner le QR code par le caissier, réglez votre facture via différents moyens de paiement."
            ]
          },
          {
            "tag": "quelles_sont_les_fonctionnalites_a_venir_de_paiecash_qr_code",
            "patterns": [
              "Quelles sont les fonctionnalités prévues pour la Version 3 ?",
              "Dites-moi ce qui est prévu dans la Version 3 de PaieCash QR Code.",
              "Quelles améliorations apportera la Version 3 de PaieCash QR Code ?"
            ],
            "responses": [
              "La Version 3 de PaieCash QR Code introduira des améliorations telles que la gestion de produits expirables, des extractions de données avancées et la possibilité de gérer les stocks avec une meilleure organisation."
            ]
          },
          {
            "tag": "paiecash_devenir_distributeur",
            "patterns": [
              "Comment puis-je devenir distributeur avec Paiecash ?",
              "Quelles sont les étapes pour devenir distributeur Paiecash ?",
              "Je veux devenir distributeur, comment faire ?"
            ],
            "responses": [
              "Pour devenir distributeur avec Paiecash, créez un compte et suivez les instructions pour commencer à profiter de nos solutions d'activation et d'intégration d'investisseurs."
            ]
          },
          {
            "tag": "paiecash_contact_support",
            "patterns": [
              "Comment puis-je contacter le support de Paiecash ?",
              "Besoin d'aide ? Où puis-je trouver de l'aide ?",
              "Support Paiecash."
            ],
            "responses": [
              "Pour toute autre question, n'hésitez pas à nous contacter à support@paiecash.com. Notre équipe est là pour vous aider à tirer le meilleur parti de notre plateforme."
            ]
          },
          {
            "tag": "campagne_appareils_indetectables",
            "patterns": [
              "Pourquoi devrais-je participer à la campagne d'appareils indétectables ?",
              "Quels sont les avantages de la campagne d'appareils indétectables ?"
            ],
            "responses": [
              "La campagne vise à vous offrir des appareils fiables et indétectables, assurant votre sécurité et tranquillité."
            ]
          },
          {
            "tag": "nombre_personnes_contactees",
            "patterns": [
              "Quel est le nombre de personnes contactées jusqu'à présent ?",
              "Combien de personnes ont été contactées dans le cadre de la campagne ?"
            ],
            "responses": [
              "À ce jour, 78 personnes ont été contactées dans le cadre de la campagne."
            ]
          },
          {
            "tag": "optimiser_service_client",
            "patterns": [
              "Comment puis-je optimiser mon service client avec cette offre ?",
              "Comment l'offre aide-t-elle à améliorer le service client ?"
            ],
            "responses": [
              "En déployant des chatbots sur vos médias sociaux, vous réduisez la charge de travail et améliorez les temps de réponse."
            ]
          },
          {
            "tag": "avantages_chatbots",
            "patterns": [
              "Quels sont les avantages des chatbots pour mon service client ?",
              "Pourquoi devrais-je utiliser des chatbots pour mon service client ?"
            ],
            "responses": [
              "Les chatbots automatisent les réponses aux questions courantes et facilitent la collecte des commentaires et le traitement des commandes."
            ]
          },
          {
            "tag": "marques_prises_en_charge",
            "patterns": [
              "Quelles marques d'appareils sont prises en charge par la campagne ?",
              "Quelles sont les marques couvertes par la campagne d'appareils indétectables ?"
            ],
            "responses": [
              "La campagne couvre une variété de marques, dont Infinix, Tecno, Sony, Huawei, etc."
            ]
          },
          {
            "tag": "details_forfaits_disponibles",
            "patterns": [
              "Pouvez-vous fournir plus de détails sur les forfaits disponibles ?",
              "Quels sont les détails des forfaits proposés ?"
            ],
            "responses": [
              "Nous offrons une gamme de forfaits, de la MTN WANDA au MT4, adaptés à vos besoins et à votre budget."
            ]
          },
          {
            "tag": "souscrire_offre_appareils_indetectables",
            "patterns": [
              "Comment puis-je souscrire à cette offre d'appareils indétectables ?",
              "Quelle est la procédure pour souscrire à l'offre d'appareils indétectables ?"
            ],
            "responses": [
              "Pour souscrire, veuillez contacter notre équipe d'assistance ou visiter notre site Web."
            ]
          },
          {
            "tag": "methodes_paiement_acceptees",
            "patterns": [
              "Quelles sont les méthodes de paiement acceptées pour ces appareils ?",
              "Pouvez-vous me dire quelles méthodes de paiement sont acceptées pour les appareils ?"
            ],
            "responses": [
              "Nous acceptons plusieurs méthodes de paiement sécurisées, y compris les options en ligne et en personne."
            ]
          },
          {
            "tag": "compatibilite_reseaux_4G+",
            "patterns": [
              "Est-ce que ces appareils sont compatibles avec les réseaux 4G+ ?",
              "Les appareils sont-ils compatibles avec la 4G+ ?"
            ],
            "responses": [
              "Oui, nos appareils prennent en charge les réseaux 4G+ pour une connectivité rapide et fiable."
            ]
          },
          {
            "tag": "aide_en_cas_de_probleme",
            "patterns": [
              "Comment puis-je obtenir de l'aide en cas de problème avec mon appareil ?",
              "Que faire si j'ai des problèmes avec mon appareil ?"
            ],
            "responses": [
              "Notre équipe d'assistance est disponible pour répondre à vos questions et résoudre tout problème que vous pourriez rencontrer."
            ]
          },
          {
            "tag": "suivi_commande",
            "patterns": [
              "Comment puis-je suivre l'état de ma commande ?",
              "Où puis-je trouver des informations sur ma commande ?",
              "Quel est le statut de ma commande ?"
            ],
            "responses": [
              "Connectez-vous à votre compte et accédez à la section 'Suivi des commandes' pour obtenir des informations détaillées sur l'état actuel de votre commande."
            ]
          },
          {
            "tag": "exporter_donnees",
            "patterns": [
              "Comment exporter les données de suivi des ventes ?",
              "Je veux télécharger les données de suivi des ventes. Comment faire ?",
              "Quels formats sont disponibles pour l'export des données ?"
            ],
            "responses": [
              "Vous pouvez exporter les données de suivi des ventes au format CSV, MS-Excel ou TXT. Allez dans la section 'Export' et choisissez le format souhaité pour télécharger les données."
            ]
          },
          {
            "tag": "mise_a_jour_compte",
            "patterns": [
              "Comment puis-je mettre à jour les informations de mon compte vendeur ?",
              "Je souhaite modifier les détails de mon compte. Que dois-je faire ?",
              "Où trouver la section de mise à jour du profil vendeur ?"
            ],
            "responses": [
              "Pour mettre à jour les informations de votre compte vendeur, accédez à la section 'Profil' et suivez les étapes pour modifier les détails nécessaires."
            ]
          },
          {
            "tag": "stock_produit",
            "patterns": [
              "Comment savoir si un produit est en stock ?",
              "Je veux vérifier la disponibilité d'un produit. Comment faire ?",
              "Les produits que je souhaite acheter sont-ils disponibles ?"
            ],
            "responses": [
              "Consultez la section 'Suivi des stocks' pour vérifier la disponibilité des produits. Les quantités d'entrée, de sortie et les dates associées sont disponibles pour vous aider à suivre les niveaux de stock."
            ]
          },
          {
            "tag": "service_client",
            "patterns": [
              "Comment contacter le service client pour des questions spécifiques sur ma commande ?",
              "J'ai des questions sur ma commande. Comment puis-je contacter le service client ?",
              "Où puis-je trouver de l'aide pour des problèmes liés à ma commande ?"
            ],
            "responses": [
              "Pour des questions spécifiques sur votre commande, utilisez le formulaire de contact dans la section 'Service Client' ou envoyez un e-mail à l'adresse fournie pour obtenir une assistance rapide."
            ]
          },
          {
            "tag": "paiecash_bi_qu_est_ce_que",
            "patterns": [
              "Qu'est-ce que Paiecash bi ?",
              "Qu'est-ce que Paiecash bi ?",
              "Paiecash bi, c'est quoi ?"
            ],
            "responses": [
              "Paiecash bi est une plateforme innovante qui propose des solutions dans les domaines de la veille technologique, de l'exploitation de données (data mining), de la science des données (data science), de la business intelligence pour le marketing, de la gestion des actifs d'entreprise (asset management), ainsi que de l'intelligence artificielle pour le marketing et les performances sportives."
            ]
          },
          {
            "tag": "comment_paiecash_bi_peut_aider",
            "patterns": [
              "Comment Paiecash bi peut-il aider mon entreprise ?",
              "En quoi Paiecash bi peut-il être bénéfique pour mon entreprise ?",
              "Quels avantages Paiecash bi peut-il apporter à mon entreprise ?"
            ],
            "responses": [
              "Paiecash bi offre une gamme complète de solutions, de l'exploration des données à l'intelligence artificielle, pour optimiser votre activité. Vous pouvez bénéficier d'une meilleure compréhension de vos données, d'une amélioration de votre marketing et de l'automatisation de certains processus."
            ]
          },
          {
            "tag": "activation_de_partenariat",
            "patterns": [
              "Qu'est-ce que l'activation de partenariat, comme dans le cas de l'ASM Clermont Auvergne ?",
              "Pouvez-vous expliquer ce que signifie l'activation de partenariat, en particulier dans le contexte de l'ASM Clermont Auvergne ?",
              "L'activation de partenariat, c'est quoi, notamment dans le cas de l'ASM Clermont Auvergne ?"
            ],
            "responses": [
              "L'activation de partenariat consiste à utiliser des initiatives créatives pour mettre en valeur les relations de partenariat. Dans le cas de l'ASM Clermont Auvergne, l'activation a permis à la Banque Populaire de renforcer son partenariat en offrant des récompenses aux supporters, tout en collectant des données pour des campagnes futures."
            ]
          },
          {
            "tag": "offre_e-commerce_et_merchandising",
            "patterns": [
              "Comment puis-je profiter de l'offre E-commerce et merchandising de Paiecash bi ?",
              "Quels avantages puis-je obtenir de l'offre E-commerce et merchandising de Paiecash bi ?",
              "En quoi consiste l'offre E-commerce et merchandising de Paiecash bi ?"
            ],
            "responses": [
              "L'offre E-commerce et merchandising de Paiecash bi vous permet de dynamiser vos ventes en ligne grâce à des stratégies marketing ciblées et à une optimisation de la présentation de vos produits. Vous pouvez améliorer l'expérience d'achat de vos clients tout en augmentant vos revenus."
            ]
          },
          {
            "tag": "mise_en_place_chatbot_service_client",
            "patterns": [
              "Comment puis-je mettre en place un chatbot pour mon service client ?",
              "Quelles étapes dois-je suivre pour intégrer un chatbot à mon service client grâce à Paiecash bi ?",
              "Pouvez-vous m'expliquer comment avoir un chatbot pour mon service client avec Paiecash bi ?"
            ],
            "responses": [
              "Paiecash bi propose des solutions avancées, y compris la mise en place de chatbots sur vos médias sociaux. Ces chatbots peuvent réduire la charge de travail de votre service client, améliorer les temps de réponse et fournir aux clients un moyen pratique d'obtenir les informations dont ils ont besoin."
            ]
          },
          {
            "tag": "personnalisation_campagnes_emailing_et_sms",
            "patterns": [
              "Puis-je personnaliser les campagnes emailing et SMS grâce à Paiecash bi ?",
              "Comment puis-je personnaliser mes campagnes emailing et SMS avec l'aide de Paiecash bi ?",
              "Quelles sont les possibilités de personnalisation des campagnes emailing et SMS offertes par Paiecash bi ?"
            ],
            "responses": [
              "Absolument, en collectant des données à partir de jeux concours comme celui de l'ASM Clermont Auvergne, vous pouvez enrichir votre CRM avec des adresses e-mail et des numéros de téléphone. Cela vous permet de créer des campagnes emailing et SMS personnalisées pour engager vos clients de manière plus ciblée."
            ]
          },
          {
            "tag": "services_intelligence_artificielle_marketing",
            "patterns": [
              "Comment puis-je bénéficier des services d'intelligence artificielle pour le marketing ?",
              "En quoi consistent les services d'intelligence artificielle pour le marketing proposés par Paiecash bi ?",
              "Quels sont les avantages de l'utilisation de l'intelligence artificielle dans le marketing avec Paiecash bi ?"
            ],
            "responses": [
              "Paiecash bi offre des solutions d'intelligence artificielle pour améliorer votre stratégie marketing. Cela inclut l'analyse de données pour comprendre les préférences des clients, ainsi que l'utilisation de l'IA pour créer des campagnes plus efficaces et personnalisées."
            ]
          },
          {
            "tag": "comment_demarrer_avec_paiecash_bi",
            "patterns": [
              "Comment puis-je démarrer avec Paiecash bi ?",
              "Quelles sont les étapes pour commencer à utiliser les services de Paiecash bi ?",
              "Comment puis-je entrer en contact avec Paiecash bi pour débuter ?"
            ],
            "responses": [
              "Pour commencer avec Paiecash bi et découvrir comment nos solutions peuvent bénéficier à votre entreprise, contactez notre équipe dès aujourd'hui. Nous serions ravis de discuter de vos besoins et de vous présenter nos services."
            ]
          },
          {
            "tag": "qu_est_ce_que_paiecash_et_en_quoi_consiste_ce_partenariat",
            "patterns": [
              "Qu'est-ce que PaieCash et en quoi consiste ce partenariat ?"
            ],
            "responses": [
              "PaieCash est une solution de facilitation des transactions qui s'associe aux clubs amateurs et à leurs investisseurs pour stimuler les échanges. Ce partenariat favorise le développement sportif et social."
            ]
          },
          {
            "tag": "comment_les_adherents_du_club_beneficient_ils_de_ce_partenariat",
            "patterns": [
              "Comment les adhérents du club bénéficient-ils de ce partenariat ?"
            ],
            "responses": [
              "Les adhérents profitent d'avantages tels que la gestion simplifiée des cotisations et des paiements, ainsi que l'accès à des fonctionnalités conviviales pour les équipes sportives."
            ]
          },
          {
            "tag": "comment_fonctionne_la_collaboration_avec_les_collectivites_locales_et_les_commercants",
            "patterns": [
              "Comment fonctionne la collaboration avec les collectivités locales et les commerçants ?"
            ],
            "responses": [
              "PaieCash collabore avec les collectivités locales et les commerçants pour proposer des solutions de financement, ainsi que pour promouvoir les activités des clubs et assurer une visibilité accrue."
            ]
          },
          {
            "tag": "comment_puis_je_gerer_les_transactions_et_les_paiements_avec_paiecash",
            "patterns": [
              "Comment puis-je gérer les transactions et les paiements avec PaieCash ?"
            ],
            "responses": [
              "PaieCash offre une plateforme numérique pour gérer efficacement les paiements, les cotisations, les recettes de buvette et d'événements. Elle permet également d'inscrire les équipes aux compétitions sportives."
            ]
          },
          {
            "tag": "comment_puis_je_utiliser_la_solution_de_paiement_paiecash",
            "patterns": [
              "Comment puis-je utiliser la solution de paiement PaieCash ?"
            ],
            "responses": [
              "La solution PaieCash offre une carte personnalisée aux couleurs de votre club, permettant des transactions immédiates via la carte, le scan du code ou l'application."
            ]
          },
          {
            "tag": "comment_paiecash_favorise_t_il_le_developpement_numerique_et_la_visibilite_du_club",
            "patterns": [
              "Comment PaieCash favorise-t-il le développement numérique et la visibilité du club ?"
            ],
            "responses": [
              "PaieCash met en place des solutions numériques pour les clubs, favorisant la visibilité, la communication et l'interaction avec les investisseurs, les sponsors et les adhérents."
            ]
          },
          {
            "tag": "comment_puis_je_choisir_loffre_paiecash_qui_me_convient_le_mieux",
            "patterns": [
              "Comment puis-je choisir l'offre PaieCash qui me convient le mieux ?"
            ],
            "responses": [
              "PaieCash propose des offres échelonnées pour répondre aux besoins spécifiques de chaque club. Nous vous invitons à prendre rendez-vous pour discuter de l'offre la plus adaptée à votre situation."
            ]
          },
          {
            "tag": "comment_puis_je_contacter_paiecash_pour_en_savoir_plus",
            "patterns": [
              "Comment puis-je contacter PaieCash pour en savoir plus ?"
            ],
            "responses": [
              "Vous pouvez nous contacter au +33 7 67 12 96 52 ou visiter notre site web www.paiecash.com pour obtenir plus d'informations sur nos services et notre partenariat avec les clubs amateurs."
            ]
          },
          {
            "tag": "achat_carte_clubs",
            "patterns": [
              "Comment puis-je acheter une carte sur le site des clubs ?",
              "Comment commander une carte sur le site des clubs ?",
              "Quel est le processus d'achat d'une carte sur le site des clubs ?"
            ],
            "responses": [
              "Choisissez la carte et le style souhaités, remplissez vos informations, y compris l'adresse de livraison et les détails de votre carte bancaire, puis validez le paiement. Vous recevrez un reçu de paiement avec la date de disponibilité de votre carte."
            ]
          },
          {
            "tag": "traitement_commande_apres_paiement",
            "patterns": [
              "Comment la commande est-elle traitée après le paiement ?",
              "Que se passe-t-il après avoir payé ma commande ?",
              "Comment Paiecash traite-t-il ma commande après paiement ?"
            ],
            "responses": [
              "Paiecash reçoit votre commande et vous recevrez votre carte à l'adresse indiquée dans les délais prévus."
            ]
          },
          {
            "tag": "paiement_panier_en_ligne",
            "patterns": [
              "Comment effectuer un paiement pour mon panier en ligne ?",
              "Quelle est la procédure de paiement pour mon panier en ligne ?",
              "Comment puis-je payer pour mes achats en ligne ?"
            ],
            "responses": [
              "Lorsque vous ouvrez la page de paiement, un lien de paiement est généré avec le montant correspondant à votre panier. Utilisez la référence de commande pour effectuer le paiement."
            ]
          },
          {
            "tag": "paiement_via_paiecash_qr",
            "patterns": [
              "Comment fonctionne le paiement via Paiecash QR dans les supermarchés ?",
              "Expliquez le processus de paiement avec Paiecash QR dans les supermarchés.",
              "Comment puis-je utiliser Paiecash QR pour payer dans les supermarchés ?"
            ],
            "responses": [
              "Choisissez le supermarché et le système ouvrira la page de paiement pour faciliter le paiement sur place. La référence de paiement est générée automatiquement et le statut du paiement est mis à jour dans notre système."
            ]
          },
          {
            "tag": "paiement_par_qr_code",
            "patterns": [
              "Comment payer en scannant un QR Code ?",
              "Quelle est la procédure pour payer en scannant un QR Code ?",
              "Comment fonctionne le paiement par scan de QR Code ?"
            ],
            "responses": [
              "Après avoir rempli votre panier, cliquez sur le bouton de scan. Scannez le QR Code de la caisse, le système ouvrira la page de paiement où vous pourrez saisir vos informations bancaires et valider."
            ]
          },
          {
            "tag": "informations_necessaires_paiement",
            "patterns": [
              "Quelles informations sont nécessaires pour initier un paiement ?",
              "Que dois-je fournir pour commencer un paiement ?",
              "Quels sont les détails requis pour un paiement ?"
            ],
            "responses": [
              "Vous devez fournir des informations telles que le montant, la référence, vos coordonnées, et d'autres détails pertinents."
            ]
          },
          {
            "tag": "annulation_paiement",
            "patterns": [
              "Puis-je annuler un paiement déjà effectué ?",
              "Est-il possible d'annuler un paiement que j'ai déjà effectué ?",
              "Comment puis-je annuler un paiement effectué ?"
            ],
            "responses": [
              "Oui, sous certaines conditions."
            ]
          },
          {
            "tag": "verification_statut_paiement",
            "patterns": [
              "Comment vérifier le statut d'un paiement ?",
              "Où puis-je vérifier le statut de mon paiement ?",
              "Comment savoir si mon paiement a été traité ?"
            ],
            "responses": [
              "Utilisez la référence de paiement pour vérifier le statut via notre système."
            ]
          },
          {
            "tag": "qrcodes_objectif",
            "patterns": [
              "Quel est l'objectif des QRCodes sur les produits Paiecash ?",
              "Pourquoi Paiecash utilise-t-il des QRCodes sur ses produits ?",
              "À quoi servent les QRCodes sur les produits Paiecash ?"
            ],
            "responses": [
              "Les QRCodes sont utilisés pour identifier de manière unique les produits Paiecash en termes de qualité et fournir des informations telles que la date de péremption, le lieu de fabrication, l'usine et le pays."
            ]
          },
          {
            "tag": "qrcodes_fonctionnement",
            "patterns": [
              "Comment fonctionnent les QRCodes de Paiecash ?",
              "Comment utiliser les QRCodes Paiecash ?",
              "Expliquez le fonctionnement des QRCodes de Paiecash."
            ],
            "responses": [
              "Chaque produit Paiecash est associé à un QRCodes unique qui peut être scanné à l'aide d'une application mobile. Cela permet d'accéder instantanément aux informations essentielles du produit."
            ]
          },
  {
    "tag": "qrcodes_informations",
    "patterns": [
      "Quelles informations sont disponibles via les QRCodes ?",
      "Que puis-je découvrir en scannant un QRCodes Paiecash ?",
      "Donnez-moi plus de détails sur les informations fournies par les QRCodes."
    ],
    "responses": [
      "Les QRCodes fournissent des détails tels que la date de péremption, le lieu de fabrication, l'usine de production et le pays d'origine du produit."
    ]
  },
  {
    "tag": "qrcodes_scanner",
    "patterns": [
      "Comment puis-je scanner un QRCodes Paiecash ?",
      "Quelle est la méthode pour lire un QRCodes Paiecash ?",
      "Expliquez comment utiliser l'application mobile pour scanner un QRCodes Paiecash."
    ],
    "responses": [
      "Téléchargez simplement notre application mobile, ouvrez-la et scannez le QRCodes en utilisant l'appareil photo de votre téléphone."
    ]
  },
  {
    "tag": "qrcodes_presence",
    "patterns": [
      "Est-ce que tous les produits Paiecash ont un QRCodes ?",
      "Les QRCodes sont-ils présents sur tous les produits Paiecash ?",
      "Quelle est la politique de Paiecash concernant les QRCodes sur ses produits ?"
    ],
    "responses": [
      "Oui, tous nos produits sont équipés d'un QRCodes pour garantir une traçabilité et une transparence maximales."
    ]
  },
  {
    "tag": "qrcodes_securite",
    "patterns": [
      "Les QRCodes de Paiecash sont-ils sécurisés ?",
      "Puis-je faire confiance à la sécurité des QRCodes Paiecash ?",
      "Comment Paiecash protège-t-il ses QRCodes contre la falsification ?"
    ],
    "responses": [
      "Absolument, nos QRCodes sont sécurisés et conçus pour empêcher toute falsification."
    ]
  },
  {
    "tag": "qrcodes_authenticite",
    "patterns": [
      "Puis-je utiliser les QRCodes pour vérifier l'authenticité d'un produit ?",
      "Comment puis-je savoir si un produit Paiecash est authentique en scannant son QRCodes ?",
      "Les QRCodes permettent-ils de confirmer l'authenticité d'un produit Paiecash ?"
    ],
    "responses": [
      "Oui, en scannant le QRCodes, vous pouvez vérifier instantanément l'authenticité d'un produit Paiecash et accéder à ses informations de qualité."
    ]
  },
  {
    "tag": "qrcodes_experience",
    "patterns": [
      "Comment les QRCodes Paiecash améliorent-ils mon expérience en tant que consommateur ?",
      "En quoi les QRCodes facilitent-ils mon expérience en tant que client Paiecash ?",
      "Quels sont les avantages des QRCodes pour les consommateurs Paiecash ?"
    ],
    "responses": [
      "Les QRCodes simplifient l'accès aux informations essentielles sur les produits, vous permettant de prendre des décisions d'achat éclairées."
    ]
  },
  {
    "tag": "qrcodes_connexion",
    "patterns": [
      "Puis-je accéder aux QRCodes sans connexion Internet ?",
      "Est-il nécessaire d'avoir une connexion Internet pour utiliser les QRCodes ?",
      "Les QRCodes Paiecash fonctionnent-ils hors ligne ?"
    ],
    "responses": [
      "Non, une connexion Internet est requise pour accéder aux informations via les QRCodes."
    ]
  },
  {
    "tag": "qrcodes_confidentialite",
    "patterns": [
      "Comment Paiecash garantit-il la confidentialité de mes données lors de l'utilisation des QRCodes ?",
      "Quelles mesures de sécurité sont en place pour protéger mes données lorsque j'utilise les QRCodes ?",
      "Est-ce que mes données personnelles sont en sécurité lorsque j'utilise les QRCodes Paiecash ?"
    ],
    "responses": [
      "Vos données personnelles sont sécurisées et traitées conformément à notre politique de confidentialité. Les informations accessibles via les QRCodes sont spécifiquement liées au produit."
    ]
  },
  {
    "tag": "qu_est_ce_que_paiecash",
    "patterns": [
      "Qu'est-ce que Paiecash ?",
      "Qu'est-ce que Paiecash",
      "Paiecash"
    ],
    "responses": [
      "Paiecash est une plateforme offrant des services de paiement et de gestion de comptes. Notre gamme de fonctionnalités inclut des options de recharge, des paiements, des comptes utilisateur et bien plus encore."
    ]
  },
  {
    "tag": "utilisation_des_chatbots",
    "patterns": [
      "Comment les chatbots sont-ils utilisés sur Paiecash ?",
      "Utilisation des chatbots sur Paiecash",
      "Chatbots Paiecash"
    ],
    "responses": [
      "Les chatbots sont déployés pour améliorer l'expérience utilisateur. Ils peuvent répondre aux questions fréquemment posées, collecter des commentaires et aider dans le traitement des paiements et des recharges."
    ]
  },
  {
    "tag": "options_de_paiement",
    "patterns": [
      "Quelles sont les options de paiement disponibles sur Paiecash ?",
      "Options de paiement Paiecash",
      "Méthodes de paiement acceptées"
    ],
    "responses": [
      "Paiecash prend en charge plusieurs méthodes de paiement, y compris OrangeMoney, CarteBancaire et MtnMoney. Vous pouvez facilement effectuer des paiements à partir de votre compte enregistré."
    ]
  },
  {
    "tag": "gestion_des_comptes_utilisateurs",
    "patterns": [
      "Comment puis-je gérer mes comptes utilisateurs ?",
      "Gestion des comptes sur Paiecash",
      "Ajouter des comptes utilisateurs"
    ],
    "responses": [
      "En tant qu'utilisateur, vous pouvez avoir plusieurs comptes associés à un compte principal. Cela permet une gestion simplifiée de vos finances. Pour ajouter ou gérer des comptes, accédez à la section 'Comptes' de votre profil."
    ]
  },
  {
    "tag": "obtenir_de_l_aide",
    "patterns": [
      "Comment puis-je obtenir de l'aide en cas de problème ?",
      "Besoin d'aide sur Paiecash",
      "Assistance client"
    ],
    "responses": [
      "Si vous rencontrez des difficultés ou avez des questions, consultez notre section d'aide en ligne. Vous y trouverez des réponses aux questions fréquentes. Si votre problème persiste, n'hésitez pas à contacter notre équipe d'assistance."
    ]
  },
  {
    "tag": "rester_informe_des_nouveautes",
    "patterns": [
      "Comment rester informé des nouveautés de Paiecash ?",
      "Nouveautés sur Paiecash",
      "Abonnement à la newsletter"
    ],
    "responses": [
      "Pour suivre les dernières mises à jour et les nouveautés de Paiecash, abonnez-vous à notre newsletter. Vous recevrez régulièrement des informations sur les nouvelles fonctionnalités, les offres spéciales et les événements."
    ]
  },
  {
    "tag": "geolocalisation_sur_paiecash",
    "patterns": [
      "Comment fonctionne la géolocalisation sur Paiecash ?",
      "Géolocalisation Paiecash",
      "Localisation des services Paiecash"
    ],
    "responses": [
      "La géolocalisation est utilisée pour fournir des informations contextuelles, telles que les points de recharge ou les partenaires à proximité. Cette fonctionnalité vous aide à trouver rapidement ce dont vous avez besoin."
    ]
  },
  {
    "tag": "acces_a_votre_compte_paiecash",
    "patterns": [
      "Comment puis-je accéder à mon compte Paiecash ?",
      "Accès à votre compte sur Paiecash",
      "Connexion à Paiecash"
    ],
    "responses": [
      "Vous pouvez vous connecter à votre compte Paiecash en utilisant vos identifiants de connexion sur notre site web ou notre application mobile. Si vous n'avez pas de compte, inscrivez-vous pour en créer un."
    ]
  },
  {
    "tag": "etapes_pour_effectuer_un_paiement",
    "patterns": [
      "Quelles sont les étapes pour effectuer un paiement sur Paiecash ?",
      "Paiement sur Paiecash",
      "Processus de paiement"
    ],
    "responses": [
      "Pour effectuer un paiement, connectez-vous à votre compte, sélectionnez l'option de paiement, choisissez le compte source et le destinataire, puis confirmez la transaction. Une fois confirmée, le paiement sera traité."
    ]
  },
  {
    "tag": "contacter_le_support_client",
    "patterns": [
      "Comment puis-je contacter le support client de Paiecash ?",
      "Support client Paiecash",
      "Service client"
    ],
    "responses": [
      "Si vous avez des questions ou des préoccupations, notre équipe d'assistance est là pour vous aider. Utilisez notre formulaire de contact sur le site ou envoyez-nous un e-mail à l'adresse indiquée sur notre page de support."
    ]
  },
  {
    "tag": "qu_est_ce_que_paiecash",
    "patterns": [
      "Qu'est-ce que Paiecash ?",
      "Que propose Paiecash ?"
    ],
    "responses": [
      "Paiecash est une plateforme qui propose une gamme de services de paiement et de recharge, tels que les recharges de type OrangeMoney, CarteBancaire et MtnMoney, ainsi que des paiements et des achats de tickets. Notre plateforme vise à simplifier vos transactions financières."
    ]
  },
  {
    "tag": "utilisation_services_recharge",
    "patterns": [
      "Comment puis-je utiliser les services de recharge sur Paiecash ?",
      "Quelles méthodes de recharge puis-je utiliser sur Paiecash ?"
    ],
    "responses": [
      "Vous pouvez recharger votre compte en utilisant des méthodes telles que OrangeMoney, CarteBancaire et MtnMoney. Sélectionnez simplement le type de recharge que vous préférez et suivez les instructions pour effectuer la transaction."
    ]
  },
  {
    "tag": "avantages_chatbots",
    "patterns": [
      "Quels sont les avantages de l'utilisation de chatbots sur Paiecash ?",
      "Pourquoi devrais-je utiliser des chatbots sur Paiecash ?"
    ],
    "responses": [
      "Les chatbots sur Paiecash vous permettent de poser des questions fréquentes, d'obtenir des réponses instantanées et de gérer vos transactions de manière efficace. Cela simplifie votre expérience utilisateur et réduit le temps d'attente pour obtenir de l'aide."
    ]
  },
  {
    "tag": "paiements_via_paiecash",
    "patterns": [
      "Puis-je effectuer des paiements via Paiecash ?",
      "Comment puis-je effectuer un paiement sur Paiecash ?"
    ],
    "responses": [
      "Oui, Paiecash offre la possibilité d'effectuer des paiements à partir de votre compte. Vous pouvez associer un compte à votre paiement et suivre le processus de paiement facilement."
    ]
  },
  {
    "tag": "obtenir_de_l_aide",
    "patterns": [
      "Comment puis-je obtenir de l'aide en cas de problème sur Paiecash ?",
      "Que faire si j'ai des problèmes avec Paiecash ?"
    ],
    "responses": [
      "Si vous rencontrez des problèmes ou avez des questions, vous pouvez utiliser notre service de chatbot pour obtenir des réponses rapides. Si le problème persiste, vous pouvez également contacter notre équipe d'assistance via les coordonnées fournies sur notre site web."
    ]
  },
  {
    "tag": "fonctionnalites_geolocalisation",
    "patterns": [
      "Est-ce que Paiecash propose des fonctionnalités de géolocalisation ?",
      "Comment puis-je utiliser la géolocalisation sur Paiecash ?"
    ],
    "responses": [
      "Oui, Paiecash propose des fonctionnalités de géolocalisation pour faciliter la recherche de lieux tels que les stades et les points de recharge. Cela vous aide à trouver rapidement les informations dont vous avez besoin."
    ]
  },
  {
    "tag": "creation_compte",
    "patterns": [
      "Comment puis-je créer un compte Paiecash ?",
      "Quels sont les étapes pour m'inscrire sur Paiecash ?"
    ],
    "responses": [
      "Pour créer un compte sur Paiecash, visitez notre site web et suivez les instructions d'inscription. Vous devrez fournir des informations de base et créer un identifiant unique pour votre compte."
    ]
  },
  {
    "tag": "temps_traitement_paiement",
    "patterns": [
      "Combien de temps faut-il pour traiter un paiement sur Paiecash ?",
      "Quelle est la durée de traitement des paiements sur Paiecash ?"
    ],
    "responses": [
      "Le temps de traitement des paiements sur Paiecash dépend du type de transaction et du mode de paiement que vous choisissez. En général, la plupart des paiements sont traités en quelques minutes à quelques heures."
    ]
  },
  {
    "tag": "mise_a_jour_informations_compte",
    "patterns": [
      "Comment mettre à jour mes informations de compte sur Paiecash ?",
      "Puis-je modifier les détails de mon compte Paiecash ?"
    ],
    "responses": [
      "Vous pouvez mettre à jour vos informations de compte en accédant à votre profil sur Paiecash. Vous aurez la possibilité de modifier vos détails personnels et vos préférences."
    ]
  },
  {
    "tag": "support_en_plusieurs_langues",
    "patterns": [
      "Est-ce que Paiecash offre un support en plusieurs langues ?",
      "Dans quelles langues puis-je obtenir de l'aide sur Paiecash ?"
    ],
    "responses": [
      "Actuellement, Paiecash offre un support en langue [indiquez les langues prises en charge]. Nous travaillons constamment pour étendre notre support à d'autres langues dans le futur."
    ]
  },
  {
    "tag": "qu-est-ce-que-paiecash-et-le-partenariat",
    "patterns": [
      "Qu'est-ce que PaieCash et en quoi consiste ce partenariat ?",
      "Expliquez PaieCash et son partenariat.",
      "Pouvez-vous me parler de PaieCash et de son partenariat ?"
    ],
    "responses": [
      "PaieCash est une solution de facilitation des transactions qui s'associe aux clubs amateurs et à leurs investisseurs pour stimuler les échanges. Ce partenariat favorise le développement sportif et social."
    ]
  },
  {
    "tag": "avantages-partenariat-pour-adherents",
    "patterns": [
      "Comment les adhérents du club bénéficient-ils de ce partenariat ?",
      "Quels avantages les membres du club obtiennent-ils de ce partenariat ?",
      "En quoi ce partenariat est-il avantageux pour les adhérents du club ?"
    ],
    "responses": [
      "Les adhérents profitent d'avantages tels que la gestion simplifiée des cotisations et des paiements, ainsi que l'accès à des fonctionnalités conviviales pour les équipes sportives."
    ]
  },
  {
    "tag": "collaboration-avec-collectivites-et-commercants",
    "patterns": [
      "Comment fonctionne la collaboration avec les collectivités locales et les commerçants ?",
      "Expliquez la relation avec les collectivités et les commerçants.",
      "Pouvez-vous détailler la collaboration avec les collectivités et les commerçants ?"
    ],
    "responses": [
      "PaieCash collabore avec les collectivités locales et les commerçants pour proposer des solutions de financement, ainsi que pour promouvoir les activités des clubs et assurer une visibilité accrue."
    ]
  },
  {
    "tag": "gestion-transactions-et-paiements",
    "patterns": [
      "Comment puis-je gérer les transactions et les paiements avec PaieCash ?",
      "Expliquez le processus de gestion des paiements avec PaieCash.",
      "Quelles sont les étapes pour gérer les transactions avec PaieCash ?"
    ],
    "responses": [
      "PaieCash offre une plateforme numérique pour gérer efficacement les paiements, les cotisations, les recettes de buvette et d'événements. Elle permet également d'inscrire les équipes aux compétitions sportives."
    ]
  },
  {
    "tag": "utilisation-solution-paiecash",
    "patterns": [
      "Comment puis-je utiliser la solution de paiement PaieCash ?",
      "Expliquez le fonctionnement de la solution PaieCash.",
      "Quelles sont les options pour utiliser la solution PaieCash ?"
    ],
    "responses": [
      "La solution PaieCash offre une carte personnalisée aux couleurs de votre club, permettant des transactions immédiates via la carte, le scan du code ou l'application."
    ]
  },
  {
    "tag": "developpement-numerique-et-visibilite-club",
    "patterns": [
      "Comment PaieCash favorise-t-il le développement numérique et la visibilité du club ?",
      "Expliquez comment PaieCash contribue au développement numérique des clubs.",
      "Quels sont les avantages de PaieCash en termes de visibilité pour les clubs ?"
    ],
    "responses": [
      "PaieCash met en place des solutions numériques pour les clubs, favorisant la visibilité, la communication et l'interaction avec les investisseurs, les sponsors et les adhérents."
    ]
  },
  {
    "tag": "choisir-offre-paiecash",
    "patterns": [
      "Comment puis-je choisir l'offre PaieCash qui me convient le mieux ?",
      "Quelles sont les options pour sélectionner une offre PaieCash ?",
      "Comment déterminer quelle offre PaieCash est la plus adaptée ?"
    ],
    "responses": [
      "PaieCash propose des offres échelonnées pour répondre aux besoins spécifiques de chaque club. Nous vous invitons à prendre rendez-vous pour discuter de l'offre la plus adaptée à votre situation."
    ]
  },
  {
    "tag": "contacter-paiecash",
    "patterns": [
      "Comment puis-je contacter PaieCash pour en savoir plus ?",
      "Quels sont les moyens de communication avec PaieCash ?",
      "Où puis-je trouver les informations de contact de PaieCash ?"
    ],
    "responses": [
      "Vous pouvez nous contacter au +33 7 67 12 96 52 ou visiter notre site web www.paiecash.com pour obtenir plus d'informations sur nos services et notre partenariat avec les clubs amateurs."
    ]
  },
  {
    "tag": "reconnaissance_qrcode",
    "patterns": [
      "Comment fonctionne la reconnaissance et l'identification via le qrcode ?"
    ],
    "responses": [
      "Le qrcode permet d'identifier l'utilisateur de PaieCash. Lorsqu'il est scanné, il permet de reconnaître et d'authentifier le propriétaire du compte."
    ]
  },
  {
    "tag": "crediter_compte_qrcode",
    "patterns": [
      "Comment créditer un compte avec un qrcode ?"
    ],
    "responses": [
      "En scannant le qrcode de l'utilisateur, vous pouvez créditer son compte en ajoutant la somme désirée. Assurez-vous d'avoir l'autorisation de l'utilisateur avant de procéder."
    ]
  },
  {
    "tag": "debit_sole_initiateur",
    "patterns": [
      "Qu'en est-il du débit du solde de l'initiateur ?"
    ],
    "responses": [
      "Lorsque vous effectuez un transfert d'argent via le qrcode, le montant est débité du solde de l'initiateur et crédité sur le compte du destinataire."
    ]
  },
  {
    "tag": "mise_en_place_transfert_qrcode",
    "patterns": [
      "Comment mettre en place le transfert d'argent via le qrcode ?"
    ],
    "responses": [
      "Le transfert d'argent via le qrcode est simple. Il suffit de scanner le qrcode du destinataire, de spécifier le montant et de confirmer la transaction."
    ]
  },
  {
    "tag": "qrcode_utilisateur",
    "patterns": [
      "Pourquoi chaque utilisateur PaieCash possède-t-il un qrcode ?"
    ],
    "responses": [
      "Le qrcode est une méthode pratique pour faciliter les transactions et les échanges d'argent entre utilisateurs PaieCash. Il simplifie le processus en évitant la saisie manuelle des informations."
    ]
  },
  {
    "tag": "obtenir_propre_qrcode",
    "patterns": [
      "Comment puis-je obtenir mon propre qrcode ?"
    ],
    "responses": [
      "Vous pouvez générer votre propre qrcode en vous connectant à votre compte PaieCash et en accédant à la section 'Mon profil'. Suivez les instructions pour générer votre qrcode unique."
    ]
  },
  {
    "tag": "personnaliser_qrcode",
    "patterns": [
      "Puis-je personnaliser mon qrcode ?"
    ],
    "responses": [
      "Actuellement, la personnalisation des qrcodes n'est pas prise en charge. Chaque qrcode est généré de manière automatique et unique pour chaque utilisateur."
    ]
  },
  {
    "tag": "utiliser_qrcode_payer",
    "patterns": [
      "Comment puis-je utiliser mon qrcode pour payer ?"
    ],
    "responses": [
      "Pour effectuer un paiement, il suffit de présenter votre qrcode au commerçant ou à la personne à qui vous souhaitez payer. Ils pourront le scanner pour effectuer la transaction."
    ]
  },
  {
    "tag": "mettre_jour_informations_qrcode",
    "patterns": [
      "Comment mettre à jour les informations liées à mon qrcode ?"
    ],
    "responses": [
      "Pour mettre à jour les informations associées à votre qrcode, connectez-vous à votre compte PaieCash et accédez à la section 'Profil'. Vous pourrez modifier vos informations personnelles."
    ]
  },
  {
    "tag": "utiliser_qrcode_plusieurs_appareils",
    "patterns": [
      "Puis-je utiliser mon qrcode sur plusieurs appareils ?"
    ],
    "responses": [
      "Oui, vous pouvez utiliser votre qrcode sur plusieurs appareils. Cependant, assurez-vous que les appareils sont liés au même compte PaieCash."
    ]
  },
  {
    "tag": "Qu'est-ce que PaieCash ?",
    "patterns": [
      "Qu'est-ce que PaieCash ?"
    ],
    "responses": [
      "PaieCash est une entreprise innovante en Afrique, offrant des solutions numériques dans les domaines de la téléphonie, d'Internet et de la télévision. Son objectif est de simplifier les transactions et les paiements en ligne pour tout le monde."
    ]
  },
  {
    "tag": "Comment créer un compte client ?",
    "patterns": [
      "Comment créer un compte client ?"
    ],
    "responses": [
      "Pour créer un compte, vous devez fournir votre adresse e-mail, votre numéro de téléphone, un mot de passe, votre nom et votre prénom."
    ]
  },
  {
    "tag": "Comment se connecter à l'application ?",
    "patterns": [
      "Comment se connecter à l'application ?"
    ],
    "responses": [
      "Après avoir créé un compte, vous pouvez vous connecter à l'application en utilisant votre numéro de téléphone et votre mot de passe."
    ]
  },
  {
    "tag": "Que faire si j'oublie mon mot de passe ?",
    "patterns": [
      "Que faire si j'oublie mon mot de passe ?"
    ],
    "responses": [
      "Si vous oubliez votre mot de passe, vous pouvez le réinitialiser en fournissant votre adresse e-mail. Vous recevrez un code que vous devrez entrer dans l'application pour changer votre mot de passe."
    ]
  },
  {
    "tag": "Comment enregistrer des produits dans mon panier ?",
    "patterns": [
      "Comment enregistrer des produits dans mon panier ?"
    ],
    "responses": [
      "Lorsque vous êtes dans un magasin, scannez les produits que vous souhaitez acheter et ajoutez-les à votre panier avec la quantité souhaitée. La quantité sera multipliée par le prix unitaire de chaque produit."
    ]
  },
  {
    "tag": "Comment valider les produits dans mon panier ?",
    "patterns": [
      "Comment valider les produits dans mon panier ?"
    ],
    "responses": [
      "Une fois que vous avez ajouté les produits que vous souhaitez acheter à votre panier, vous devez les valider pour générer un reçu. Ce reçu sera caché derrière un QR code. Le QR code reste actif tant que le paiement n'est pas effectué."
    ]
  },
  {
    "tag": "Comment effectuer un paiement à la caisse ?",
    "patterns": [
      "Comment effectuer un paiement à la caisse ?"
    ],
    "responses": [
      "Présentez le QR code lié à votre facture à la caisse pour effectuer le paiement."
    ]
  },
  {
    "tag": "Comment modifier mon profil ?",
    "patterns": [
      "Comment modifier mon profil ?"
    ],
    "responses": [
      "Vous pouvez mettre à jour votre profil en modifiant votre nom et prénom."
    ]
  },
  {
    "tag": "Comment configurer les paramètres de l'application ?",
    "patterns": [
      "Comment configurer les paramètres de l'application ?"
    ],
    "responses": [
      "Vous pouvez changer la langue de l'application en Français ou en Anglais, vous déconnecter ou consulter la politique de confidentialité de l'application."
    ]
  },
  {
    "tag": "Qu'est-ce que PaieCash QR Code ?",
    "patterns": [
      "Expliquez PaieCash QR Code",
      "En quoi consiste PaieCash QR Code ?"
    ],
    "responses": [
      "PaieCash QR Code est une solution de tickets de caisse dématérialisés via un QR code. Elle permet de récupérer votre facture ou ticket de caisse immédiatement et de façon permanente tout en conservant vos droits de garantie."
    ]
  },
  {
    "tag": "Fonctionnalités de PaieCash QR Code",
    "patterns": [
      "Quelles sont les fonctionnalités principales de PaieCash QR Code ?",
      "Listez les fonctionnalités de PaieCash QR Code."
    ],
    "responses": [
      "PaieCash QR Code propose des fonctionnalités telles que l'authentification des utilisateurs, la gestion des produits et des stocks, la gestion du panier et des tickets, la validation des tickets, l'interface admin du caissier, l'interface admin du magasin, la modération des comptes par l'administrateur, les promotions de produits, et bien d'autres."
    ]
  },
  {
    "tag": "Création de compte client",
    "patterns": [
      "Comment créer un compte client sur PaieCash QR Code ?",
      "Quels sont les étapes pour s'inscrire sur PaieCash QR Code ?"
    ],
    "responses": [
      "Pour créer un compte client, vous devez fournir votre email, numéro de téléphone et nom."
    ]
  },
  {
    "tag": "Connexion à l'application",
    "patterns": [
      "Comment se connecter à l'application PaieCash QR Code ?",
      "Quelles sont les étapes pour se connecter à PaieCash QR Code ?"
    ],
    "responses": [
      "Pour vous connecter à l'application, utilisez votre numéro de téléphone et votre mot de passe."
    ]
  },
  {
    "tag": "Réinitialisation de mot de passe",
    "patterns": [
      "Que faire si j'oublie mon mot de passe ?",
      "Comment réinitialiser mon mot de passe en cas d'oubli ?"
    ],
    "responses": [
      "Si vous oubliez votre mot de passe, vous pouvez le réinitialiser en fournissant votre adresse email. Vous recevrez un code pour réinitialiser votre mot de passe."
    ]
  },
  {
    "tag": "Gestion du panier",
    "patterns": [
      "Comment enregistrer des produits dans mon panier ?",
      "Quelle est la procédure pour ajouter des articles à mon panier ?"
    ],
    "responses": [
      "Vous pouvez scanner les produits que vous souhaitez acheter et les ajouter à votre panier avec la quantité souhaitée."
    ]
  },
  {
    "tag": "Validation du panier",
    "patterns": [
      "Comment valider les produits dans mon panier ?",
      "Quelle est la démarche pour finaliser mon panier ?"
    ],
    "responses": [
      "Une fois que vous avez ajouté les produits à votre panier, vous pouvez les valider pour générer un reçu associé à un QR code."
    ]
  },
  {
    "tag": "Paiement à la caisse",
    "patterns": [
      "Comment effectuer le paiement à la caisse ?",
      "Quelle est la procédure pour payer mes achats ?"
    ],
    "responses": [
      "Présentez le QR code lié à votre facture à la caisse pour effectuer le paiement."
    ]
  },
  {
    "tag": "Modification de profil",
    "patterns": [
      "Comment modifier mon profil ?",
      "Quelles sont les étapes pour mettre à jour mon profil ?"
    ],
    "responses": [
      "Vous pouvez mettre à jour votre profil en modifiant votre nom et prénom."
    ]
  },
  {
    "tag": "Configuration des paramètres",
    "patterns": [
      "Comment configurer les paramètres de l'application ?",
      "Quelles options de configuration sont disponibles ?"
    ],
    "responses": [
      "Vous pouvez configurer les paramètres de l'application, y compris la langue (français ou anglais), vous déconnecter et consulter la politique de confidentialité."
    ]
  },
  {
    "tag": "Promotions sur PaieCash QR Code",
    "patterns": [
      "Comment profiter des promotions sur PaieCash QR Code ?",
      "Quelles sont les étapes pour bénéficier des offres promotionnelles ?"
    ],
    "responses": [
      "Vous pouvez profiter des promotions créées par le supermarché pour obtenir des réductions sur vos achats."
    ]
  },
  {
    "tag": "Événements sur PaieCash QR Code",
    "patterns": [
      "Comment participer aux événements sur PaieCash QR Code ?",
      "Quelles sont les démarches pour assister aux événements spéciaux ?"
    ],
    "responses": [
      "Vous pouvez participer aux événements spéciaux organisés par le supermarché."
    ]
  },
  {
    "tag": "qu_est_ce_que_paiecash",
    "patterns": [
      "Qu'est-ce que Paiecash ?",
      "Expliquez-moi ce qu'est Paiecash ?"
    ],
    "responses": [
      "Paiecash est une application de fidélité et de cashback multi-commerçants qui relie les clients aux entreprises dans le but de faire gagner des récompenses et de simplifier le shopping des clients tout en aidant les entreprises à se développer et à prospérer."
    ]
  },
  {
    "tag": "services_offerts",
    "patterns": [
      "Quels sont les services offerts par Paiecash ?",
      "Dites-moi ce que propose Paiecash comme services ?"
    ],
    "responses": [
      "Paiecash offre deux principaux services : le Cashback, qui permet aux utilisateurs de recevoir un pourcentage du montant de leur paiement chez les Commerces Paiecash, et les Top Up, qui permettent d'acheter des bons d'achat digitaux utilisables chez n'importe quel Commerce Paiecash."
    ]
  },
  {
    "tag": "conditions_cashback",
    "patterns": [
      "Quelles sont les conditions d'obtention du Cashback ?",
      "Pouvez-vous me dire comment obtenir du Cashback ?"
    ],
    "responses": [
      "Pour obtenir du Cashback, vous devez effectuer un paiement chez un Commerce Paiecash et présenter votre QR code de carte de fidélité pour que la transaction soit enregistrée. Les détails spécifiques du Cashback peuvent varier d'un Commerce Paiecash à un autre."
    ]
  },
  {
    "tag": "fonctionnement_top_up",
    "patterns": [
      "Comment fonctionne le Top Up de Paiecash ?",
      "Expliquez le fonctionnement du service Top Up de Paiecash."
    ],
    "responses": [
      "Le service Top Up de Paiecash vous permet d'acheter et de gérer des bons d'achat digitaux. Ces bons d'achat sont nominatifs et personnels, et ils peuvent être utilisés chez les Commerces Paiecash."
    ]
  },
  {
    "tag": "inscription_paiecash",
    "patterns": [
      "Comment puis-je m'inscrire sur Paiecash ?",
      "Quelle est la procédure d'inscription à Paiecash ?"
    ],
    "responses": [
      "Pour vous inscrire sur Paiecash, téléchargez l'application Paiecash Client depuis l'Appstore ou le Google Play Store, puis suivez les instructions d'inscription."
    ]
  },
  {
    "tag": "conditions_top_up",
    "patterns": [
      "Quelles sont les conditions d'obtention du Top Up ?",
      "Comment peut-on obtenir des Top Up sur Paiecash ?"
    ],
    "responses": [
      "Les utilisateurs de Paiecash peuvent obtenir des Top Up de différentes manières, notamment lors d'un achat chez un Commerce Paiecash."
    ]
  },
  {
    "tag": "recevoir_cashback",
    "patterns": [
      "Quand et comment reçoit-on le Cashback ?",
      "Dites-moi quand et comment je reçois mon Cashback."
    ],
    "responses": [
      "Le Cashback est crédité instantanément sur votre compte Paiecash dans votre carte de fidélité chez le Commerce Paiecash où vous avez effectué votre paiement."
    ]
  },
  {
    "tag": "non_reception_cashback",
    "patterns": [
      "Que faire si je n'ai pas reçu mon Cashback après un paiement ?",
      "Comment résoudre le problème si je ne reçois pas mon Cashback ?"
    ],
    "responses": [
      "Si vous n'avez pas reçu votre Cashback après un paiement chez un Commerce Paiecash, veuillez contacter le support de Paiecash via l'application mobile ou par e-mail à etot@paiecash.com pour résoudre le problème."
    ]
  },
  {
    "tag": "modes_paiement",
    "patterns": [
      "Quels sont les modes de paiement acceptés par Paiecash ?",
      "Pouvez-vous me dire quels modes de paiement sont acceptés par Paiecash ?"
    ],
    "responses": [
      "Vous pouvez effectuer vos paiements chez les Commerces Paiecash en utilisant différents modes de paiement, y compris l'argent en espèces, les cartes bancaires VISA et Mastercard, OM, MTN MoMo, Yoomee Money, et d'autres moyens de paiement dématérialisés."
    ]
  },
  {
    "tag": "commerces_participants",
    "patterns": [
      "Où puis-je trouver la liste des Commerces Paiecash participants ?",
      "Comment savoir quels commerces acceptent Paiecash ?"
    ],
    "responses": [
      "Vous pouvez trouver la liste complète et mise à jour des Commerces Paiecash participants sur le site web de Paiecash : lien vers la liste."
    ]
  },
  {
    "tag": "litige_reclamation",
    "patterns": [
      "Que faire en cas de litige ou de réclamation ?",
      "Comment signaler un litige ou faire une réclamation sur Paiecash ?"
    ],
    "responses": [
      "En cas de litige ou de réclamation concernant le Cashback ou les Top Up, veuillez contacter le support client de Paiecash pour obtenir de l'aide et résoudre le problème."
    ]
  },
  {
    "tag": "protection_donnees",
    "patterns": [
      "Comment sont protégées mes données personnelles sur Paiecash ?",
      "Pouvez-vous me garantir la sécurité de mes données personnelles sur Paiecash ?"
    ],
    "responses": [
      "Paiecash Cameroun protège, utilise et respecte vos données personnelles conformément aux lois et réglementations en vigueur, notamment en matière de protection des données à caractère personnel."
    ]
  },
  {
    "tag": "lutte_fraude_blanchiment",
    "patterns": [
      "Comment Paiecash lutte-t-il contre la fraude et le blanchiment d'argent ?",
      "Quelles sont les mesures prises par Paiecash contre la fraude et le blanchiment d'argent ?"
    ],
    "responses": [
      "Paiecash s'engage à lutter contre la fraude et le blanchiment d'argent. Toute tentative de fraude expose les auteurs à des mesures telles que l'annulation de la transaction et des poursuites judiciaires."
    ]
  },
  {
    "tag": "contact_support_client",
    "patterns": [
      "Comment contacter le support client de Paiecash ?",
      "Quels sont les moyens de contacter le support client de Paiecash ?"
    ],
    "responses": [
      "Vous pouvez contacter le support client de Paiecash via l'application mobile Paiecash ou par e-mail à etot@paiecash.com. Nous sommes là pour vous aider."
    ]
  },
  {
    "tag": "cgu_paiecash",
    "patterns": [
      "Où puis-je trouver les Conditions Générales d'Utilisation complètes de Paiecash ?",
      "Comment accéder aux Conditions Générales d'Utilisation de Paiecash ?"
    ],
    "responses": [
      "Vous pouvez consulter les Conditions Générales d'Utilisation complètes de Paiecash sur le site web de Paiecash : lien vers les CGU."
    ]
  }



  ]
}