{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hey",
        "Hello",
        "Good day"

      ],
      "responses": [
        "Hey :)",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "questions",
      "patterns": [
        "How are you",
        "What's up",
        "whats up"

      ],
      "responses": [
        "I'm great! How can I help?",
        "Doing good! How can I help you?"
      ]},
        {
          "tag": "Objectifs",
          "patterns": [
            "Quels sont les objectifs de Smart 1 ?"
          ],
          "responses": [
            "Les objectifs de Smart 1 sont de proposer des solutions innovantes sur le marché tout en évitant de réinventer la roue."
          ]
        },
        {
          "tag": "Offre de gestion des stocks",
          "patterns": [
            "Quelle est l'offre de gestion et suivi des stocks de Smart 1 ?"
          ],
          "responses": [
            "L'offre de gestion des stocks de Smart 1 propose un module de stock dans les logiciels, comme PGI, Odoo et Dolibarr. Cela résulte de nombreuses années de développement et d'une grande équipe."
          ]
        },
        {
          "tag": "Stratégie",
          "patterns": [
            "Quelle est la stratégie de Smart 1 ?"
          ],
          "responses": [
            "La stratégie de Smart 1 consiste à bien étudier l'existant, identifier les manquements, et corriger les lacunes en utilisant un code existant. Ils se concentrent également sur l'attaque du marché avec une approche d'innovation plutôt que de recréer des solutions déjà existantes."
          ]
        },
        {
          "tag": "Acteurs",
          "patterns": [
            "Qui sont les acteurs impliqués dans Smart 1 ?"
          ],
          "responses": [
            "Les acteurs impliqués dans Smart 1 incluent des équipes de développement, des distributeurs, des revendeurs et des utilisateurs finaux."
          ]
        },
        {
          "tag": "Délai de réalisation",
          "patterns": [
            "Combien de temps faut-il pour réaliser le système Smart 1 ?"
          ],
          "responses": [
            "La réalisation d'un tel système à partir de zéro prendrait au moins 3 mois avec des ressources confirmées."
          ]
        },
        {
            "tag": "Qu'est-ce que PaieCash ?",
            "patterns": [
              "Qu'est-ce que PaieCash ?"
            ],
            "responses": [
              "PaieCash est une application de paiement qui propose des services de paiement via des API. Elle permet la gestion et le contrôle des activités liées à cette API de paiement."
            ]
          },
          {
            "tag": "Gestion des comptes et utilisateurs",
            "patterns": [
              "Quels sont les éléments de la gestion des comptes et utilisateurs ?"
            ],
            "responses": [
              "La gestion des comptes et utilisateurs de PaieCash comprend la création de comptes utilisateurs, l'activation/désactivation des comptes clients, la gestion des licences d'abonnement (trimestrielles, annuelles, à vie) et des forfaits d'abonnement. Un dashboard permet aux marchands de consulter leur clé d'API, leurs transactions et de configurer les URL d'erreur et de callback."
            ]
          },
          {
            "tag": "Gestion des transactions",
            "patterns": [
              "Comment PaieCash facilite-t-il la gestion des transactions ?"
            ],
            "responses": [
              "PaieCash simplifie la gestion des transactions pour chaque utilisateur. Cela inclut la liste des transactions par période et par statut (réussi, annulé, en attente, échoué), les end-points pour déclencher et vérifier l'état des paiements, ainsi que pour annuler et relancer les paiements. Les utilisateurs sont catégorisés sur le dashboard et les localisations des transactions sont gérées."
            ]
          },
          {
            "tag": "Gestion de la sécurité",
            "patterns": [
              "Quelles mesures de sécurité sont mises en place par PaieCash ?"
            ],
            "responses": [
              "PaieCash met en place des mesures de sécurité telles que 3D Secure pour valider les paiements, des comptes sécurisés avec validation des moyens de sécurité par le directeur général, et fournit des API keys et tokens de connexion sécurisés pour les interfaces utilisateur."
            ]
          },
          {
            "tag": "Gestion des commissionnements et frais",
            "patterns": [
              "Comment PaieCash gère-t-il les commissionnements et frais sur les transactions ?"
            ],
            "responses": [
              "PaieCash permet de commissionner un utilisateur avec un pourcentage précisé sur une transaction. Le choix du système de facturation (sous-commission ou abonnement) est également possible. Les utilisateurs peuvent suivre leurs commissions sur une période, tout comme l'entreprise PaieCash peut suivre ses commissions gagnées."
            ]
          },
          {
            "tag": "Gestion de la configuration du système et déploiement",
            "patterns": [
              "Comment PaieCash gère-t-il la configuration du système et le déploiement ?"
            ],
            "responses": [
              "PaieCash gère la montée en charge du nombre de requêtes, le multithread et la scalabilité. Le monitoring du système est assuré par des outils comme Travis et PM2. Une gateway gère les différents pôles de traitement des requêtes, et une version conteneurisée de la solution est déployée pour une mise en production simple et rapide."
            ]
          },
          {
            "tag": "Services de paiements concernés",
            "patterns": [
              "Quels sont les services de paiements concernés par PaieCash ?"
            ],
            "responses": [
              "PaieCash concerne Lyra pour l'Europe et l'Afrique, ainsi qu'Orange Money et MTN Money pour les wallets en Afrique."
            ]
          },
          {
            "tag": "Livrables",
            "patterns": [
              "Quels sont les livrables à la fin du développement ?"
            ],
            "responses": [
              "À la fin du développement, PaieCash livrera une interface web (Dashboard) pour gérer l'API de paiement, les transactions et les utilisateurs. Un module de tests, une documentation de l'API, une documentation Swagger testable en direct, une documentation de déploiement, un manuel utilisateur et le code source seront également fournis. Une version sera déployée sur un sous-domaine de PaieCash."
            ]
          },
          {
            "tag": "Presentation",
            "patterns": [
              "Qu'est-ce que PaieCash ?",
              "Présentation de l’entreprise"
            ],
            "responses": [
              "PaieCash est une entreprise qui développe des solutions numériques axées sur la technologie et l'innovation en Afrique. Elle offre des services dans les domaines de la téléphonie, d'Internet et de la télévision."
            ]
          },
          {
            "tag": "Objectif",
            "patterns": [
              "Quel est l'objectif du projet PaieCash ?",
              "Quels sont les avantages du projet ?"
            ],
            "responses": [
              "Le projet PaieCash vise à enrichir les paiements en ligne en offrant une application mobile sur Android et IOS, ainsi qu'un site web, pour faciliter les transactions financières et les paiements en ligne. Il résout également le problème du manque de liquidités en Afrique, offrant une solution rapide et fiable pour tous les types de paiements."
            ]
          },
          {
            "tag": "Fonctionnalites",
            "patterns": [
              "Quelles sont les fonctionnalités principales de l'application ?",
              "Quels services propose PaieCash ?"
            ],
            "responses": [
              "L'application PaieCash offre un éventail de services, notamment le transfert d'argent entre utilisateurs, les dépôts et les retraits, les paiements en ligne sur des sites marchands, la gestion des comptes utilisateurs, les échanges de devises, l'épargne, les crédits et bien d'autres."
            ]
          },
          {
            "tag": "Difference",
            "patterns": [
              "Comment PaieCash se différencie-t-il de la concurrence ?",
              "Qu'est-ce qui rend PaieCash unique ?"
            ],
            "responses": [
              "PaieCash se distingue en réunissant une variété de moyens de paiement numérique au sein d'une application conviviale. Sa portée internationale permet des transactions fiables en Afrique et à l'international."
            ]
          },
          {
            "tag": "UI/UX",
            "patterns": [
              "Comment sont conçues les interfaces de PaieCash ?",
              "Quelle est l'ergonomie de l'application ?"
            ],
            "responses": [
              "Les interfaces de PaieCash suivent les normes UI/UX, assurant une expérience conviviale. Elles respectent la norme ISO 26800:2011 pour une convivialité optimale."
            ]
          },
          {
            "tag": "Utilisateurs",
            "patterns": [
              "Qui peut devenir un utilisateur de PaieCash ?",
              "Quelle est la cible de l'application ?"
            ],
            "responses": [
              "Toute personne possédant un téléphone portable peut devenir un utilisateur de PaieCash. Cela inclut les commerçants, les entreprises, leurs clients, ainsi que les conducteurs de moto et de taxi. La grande population susceptible d'effectuer des transactions d'argent est également visée."
            ]
          },
          {
            "tag": "Concurrence",
            "patterns": [
              "Quelle est la concurrence de PaieCash ?",
              "Qui sont les concurrents de l'entreprise ?"
            ],
            "responses": [
              "La concurrence de PaieCash provient des opérateurs téléphoniques, des banques en ligne et des Wallets mobile (portefeuilles)."
            ]
          },
          {
            "tag": "Design",
            "patterns": [
              "Quelle est la charte graphique et ergonomique de PaieCash ?",
              "Comment sont définies les couleurs de l'entreprise ?"
            ],
            "responses": [
              "Les couleurs du logo de PaieCash sont le vert et le blanc, ce qui reflète sa charte graphique. L'UI/UX design respecte les normes d'une application de transfert d'argent et suit la norme ISO 26800:2011."
            ]
          },
          {
            "tag": "Livrables",
            "patterns": [
              "Quels sont les livrables attendus du projet PaieCash ?",
              "Que recevront les utilisateurs comme résultat du projet ?"
            ],
            "responses": [
              "Les livrables attendus comprennent une application mobile pour Android et IOS, une base de données cohérente, un site web et une API servant de serveur à l'application."
            ]
          },
          {
            "tag": "Budget",
            "patterns": [
              "Quel est le budget de développement de l'application PaieCash ?",
              "Comment est estimé le coût du projet ?"
            ],
            "responses": [
              "Le budget de développement de l'application PaieCash sera estimé suite à une analyse des coûts de développement, de la sécurité des applications et du déploiement. Contactez-nous pour une estimation personnalisée."
            ]
          },
          {
            "tag": "Delai",
            "patterns": [
              "Quel est le délai de livraison du projet PaieCash ?",
              "Quand l'application sera-t-elle prête ?"
            ],
            "responses": [
              "Le délai de livraison sera estimé en utilisant la méthode COCOMO en fonction de la taille du projet. Nous travaillons pour vous fournir la meilleure expérience dans les plus brefs délais."
            ]
          },
          {
            "tag": "Assistance",
            "patterns": [
              "Comment puis-je obtenir de l'aide en cas de problème avec PaieCash ?",
              "Où puis-je obtenir de l'assistance ?"
            ],
            "responses": [
              "Vous pouvez obtenir de l'aide en contactant notre équipe d'assistance via l'application PaieCash ou notre site web. Nous sommes là pour vous aider à chaque étape."
            ]
          },
          {
            "tag": "InfosFonctionnalites",
            "patterns": [
              "Où puis-je trouver plus d'informations sur les fonctionnalités de PaieCash ?",
              "Comment en savoir plus sur les services offerts par PaieCash ?"
            ],
            "responses": [
              "Pour plus d'informations détaillées sur les fonctionnalités de PaieCash, consultez notre document de Spécifications fonctionnelles disponible à ce lien : [Lien vers le document](https://docs.google.com/document/d/1-ftfFpHn4MPXxFOc6UdbObqrvROmFT_ziAix9E7CIEQ/edit?usp=share_link)"
            ]
          },
          {
            "tag": "Maquettes",
            "patterns": [
              "Où puis-je voir les maquettes de l'application PaieCash ?",
              "Où trouver les designs de PaieCash ?"
            ],
            "responses": [
              "Vous pouvez consulter les dernières maquettes de l'application PaieCash à ce lien : [Lien vers les maquettes](https://docs.google.com/document/d/1-ftfFpHn4MPXxFOc6UdbObqrvROmFT_ziAix9E7CIEQ/edit?usp=share_link)"
            ]
          },
          
        
  ]
}
